package org.ylgjj.loan.outputenum;

//import com.coalvalue.domain.pojo.ListItem;

/**
 * Created by silence on 2016/1/18.
 */
public enum E_科目字典_HX {
    E_4010501_个人贷款逾期罚息收入_业务收入__其他收入__个人贷款逾期罚息收入_40100501_3_401005 ("4010501","个人贷款逾期罚息收入","业务收入-其他收入-个人贷款逾期罚息收入","40100501","3","401005","5","2"),
    E_4010502_项目贷款逾期罚息利息收入_业务收入__其他收入__项目贷款逾期罚息利息收入_40100502_3_401005 ("4010502","项目贷款逾期罚息利息收入","业务收入-其他收入-项目贷款逾期罚息利息收入","40100502","3","401005","5","2"),
    E_101_住房公积金存款_住房公积金存款_101000_1_101000 ("101","住房公积金存款","住房公积金存款","101000","1","101000","1","1"),
    E_10101_活期存款_住房公积金存款__活期存款_101001_2_101000 ("10101","活期存款","住房公积金存款-活期存款","101001","2","101000","1","1"),
    E_10102_定期存款_住房公积金存款__定期存款_101002_2_101000 ("10102","定期存款","住房公积金存款-定期存款","101002","2","101000","1","1"),
    E_102_增值收益存款_增值收益存款_102000_1_102000 ("102","增值收益存款","增值收益存款","102000","1","102000","1","1"),
    E_10201_活期存款_增值收益存款__活期存款_102001_2_102000 ("10201","活期存款","增值收益存款-活期存款","102001","2","102000","1","1"),
    E_10202_定期存款_增值收益存款__定期存款_102002_2_102000 ("10202","定期存款","增值收益存款-定期存款","102002","2","102000","1","1"),
    E_111_应收利息_应收利息_111000_1_111000 ("111","应收利息","应收利息","111000","1","111000","1","1"),
    E_11101_应收贷款利息_应收利息__应收贷款利息_111001_2_111000 ("11101","应收贷款利息","应收利息-应收贷款利息","111001","2","111000","1","1"),
    E_11102_应收存款利息_应收利息__应收存款利息_111002_2_111000 ("11102","应收存款利息","应收利息-应收存款利息","111002","2","111000","1","1"),
    E_119_其他应收款_其他应收款_119000_1_119000 ("119","其他应收款","其他应收款","119000","1","119000","1","1"),
    E_11901_应收单位公积金_其他应收款__应收单位公积金_119001_2_119000 ("11901","应收单位公积金","其他应收款-应收单位公积金","119001","2","119000","1","1"),
    E_11902_其他_其他应收款__其他_119002_2_119000 ("11902","其他","其他应收款-其他","119002","2","119000","1","1"),
    E_121_委托贷款_委托贷款_121000_1_121000 ("121","委托贷款","委托贷款","121000","1","121000","1","1"),
    E_12101_个人贷款_委托贷款__个人贷款_121001_2_121000 ("12101","个人贷款","委托贷款-个人贷款","121001","2","121000","1","1"),
    E_12102_项目贷款_委托贷款__项目贷款_121002_2_121000 ("12102","项目贷款","委托贷款-项目贷款","121002","2","121000","1","1"),
    E_122_逾期贷款_逾期贷款_122000_1_122000 ("122","逾期贷款","逾期贷款","122000","1","122000","1","1"),
    E_12201_个人逾期贷款_逾期贷款__个人逾期贷款_122001_2_122000 ("12201","个人逾期贷款","逾期贷款-个人逾期贷款","122001","2","122000","1","1"),
    E_12202_项目逾期贷款_逾期贷款__项目逾期贷款_122002_2_122000 ("12202","项目逾期贷款","逾期贷款-项目逾期贷款","122002","2","122000","1","1"),
    E_124_国家债券_国家债券_124000_1_124000 ("124","国家债券","国家债券","124000","1","124000","1","1"),
    E_201_住房公积金_住房公积金_201000_1_201000 ("201","住房公积金","住房公积金","201000","1","201000","2","2"),
    E_211_应付利息_应付利息_211000_1_211000 ("211","应付利息","应付利息","211000","1","211000","2","2"),
    E_21101_应付公积金利息_应付利息__应付公积金利息_211001_2_211000 ("21101","应付公积金利息","应付利息-应付公积金利息","211001","2","211000","2","2"),
    E_21102_财政代扣款利息_应付利息__财政代扣款利息_211002_2_211000 ("21102","财政代扣款利息","应付利息-财政代扣款利息","211002","2","211000","2","2"),
    E_214_专项应付款_专项应付款_214000_1_214000 ("214","专项应付款","专项应付款","214000","1","214000","2","2"),
    E_21401_应付中心管理费用_专项应付款__应付中心管理费用_214001_2_214000 ("21401","应付中心管理费用","专项应付款-应付中心管理费用","214001","2","214000","2","2"),
    E_21402_应付廉租住房建设补充资金_专项应付款__应付廉租住房建设补充资金_214002_2_214000 ("21402","应付廉租住房建设补充资金","专项应付款-应付廉租住房建设补充资金","214002","2","214000","2","2"),
    E_219_其他应付款_其他应付款_219000_1_219000 ("219","其他应付款","其他应付款","219000","1","219000","2","2"),
    E_21901_单位预缴公积金_其他应付款__单位预缴公积金_219001_2_219000 ("21901","单位预缴公积金","其他应付款-单位预缴公积金","219001","2","219000","2","2"),
    E_21902_应付归集手续费_其他应付款__应付归集手续费_219002_2_219000 ("21902","应付归集手续费","其他应付款-应付归集手续费","219002","2","219000","2","2"),
    E_21903_应付贷款手续费_其他应付款__应付贷款手续费_219003_2_219000 ("21903","应付贷款手续费","其他应付款-应付贷款手续费","219003","2","219000","2","2"),
    E_21904_其他_其他应付款__其他_219004_2_219000 ("21904","其他","其他应付款-其他","219004","2","219000","2","2"),
    E_301_贷款风险准备_贷款风险准备_301000_1_301000 ("301","贷款风险准备","贷款风险准备","301000","1","301000","4","2"),
    E_30101_个人贷款风险准备金_贷款风险准备__个人贷款风险准备金_301001_2_301000 ("30101","个人贷款风险准备金","贷款风险准备-个人贷款风险准备金","301001","2","301000","4","2"),
    E_30102_项目贷款风险准备金_贷款风险准备__项目贷款风险准备金_301002_2_301000 ("30102","项目贷款风险准备金","贷款风险准备-项目贷款风险准备金","301002","2","301000","4","2"),
    E_311_增值收益_增值收益_311000_1_311000 ("311","增值收益","增值收益","311000","1","311000","4","2"),
    E_31101_本年增值收益_增值收益__本年增值收益_311001_2_311000 ("31101","本年增值收益","增值收益-本年增值收益","311001","2","311000","4","2"),
    E_321_增值收益分配_增值收益分配_321000_1_321000 ("321","增值收益分配","增值收益分配","321000","1","321000","4","2"),
    E_32101_提取贷款风险准备_增值收益分配__提取贷款风险准备_321001_2_321000 ("32101","提取贷款风险准备","增值收益分配-提取贷款风险准备","321001","2","321000","4","2"),
    E_3210101_提取个人贷款风险准备_增值收益分配__提取贷款风险准备__提取个人贷款风险准备_32100101_3_321001 ("3210101","提取个人贷款风险准备","增值收益分配-提取贷款风险准备-提取个人贷款风险准备","32100101","3","321001","4","2"),
    E_3210102_提取项目贷款风险准备_增值收益分配__提取贷款风险准备__提取项目贷款风险准备_32100102_3_321001 ("3210102","提取项目贷款风险准备","增值收益分配-提取贷款风险准备-提取项目贷款风险准备","32100102","3","321001","4","2"),
    E_32102_提取公积金中心管理费用_增值收益分配__提取公积金中心管理费用_321002_2_321000 ("32102","提取公积金中心管理费用","增值收益分配-提取公积金中心管理费用","321002","2","321000","4","2"),
    E_32103_城市廉租住房建设补充资金_增值收益分配__城市廉租住房建设补充资金_321003_2_321000 ("32103","城市廉租住房建设补充资金","增值收益分配-城市廉租住房建设补充资金","321003","2","321000","4","2"),
    E_32104_待分配增值收益_增值收益分配__待分配增值收益_321004_2_321000 ("32104","待分配增值收益","增值收益分配-待分配增值收益","321004","2","321000","4","2"),
    E_401_业务收入_业务收入_401000_1_401000 ("401","业务收入","业务收入","401000","1","401000","5","2"),
    E_40101_住房公积金利息收入_业务收入__住房公积金利息收入_401001_2_401000 ("40101","住房公积金利息收入","业务收入-住房公积金利息收入","401001","2","401000","5","2"),
    E_40102_增值收益利息收入_业务收入__增值收益利息收入_401002_2_401000 ("40102","增值收益利息收入","业务收入-增值收益利息收入","401002","2","401000","5","2"),
    E_40103_委托贷款利息收入_业务收入__委托贷款利息收入_401003_2_401000 ("40103","委托贷款利息收入","业务收入-委托贷款利息收入","401003","2","401000","5","2"),
    E_4010301_个人贷款利息收入_业务收入__委托贷款利息收入__个人贷款利息收入_40100301_3_401003 ("4010301","个人贷款利息收入","业务收入-委托贷款利息收入-个人贷款利息收入","40100301","3","401003","5","2"),
    E_4010302_项目贷款利息收入_业务收入__委托贷款利息收入__项目贷款利息收入_40100302_3_401003 ("4010302","项目贷款利息收入","业务收入-委托贷款利息收入-项目贷款利息收入","40100302","3","401003","5","2"),
    E_40104_国家债券利息收入_业务收入__国家债券利息收入_401004_2_401000 ("40104","国家债券利息收入","业务收入-国家债券利息收入","401004","2","401000","5","2"),
    E_40105_其他收入_业务收入__其他收入_401005_2_401000 ("40105","其他收入","业务收入-其他收入","401005","2","401000","5","2"),
    E_411_业务支出_业务支出_411000_1_411000 ("411","业务支出","业务支出","411000","1","411000","5","1"),
    E_41101_住房公积金利息支出_业务支出__住房公积金利息支出_411001_2_411000 ("41101","住房公积金利息支出","业务支出-住房公积金利息支出","411001","2","411000","5","1"),
    E_41102_归集手续费支出_业务支出__归集手续费支出_411002_2_411000 ("41102","归集手续费支出","业务支出-归集手续费支出","411002","2","411000","5","1"),
    E_41103_委托贷款手续费支出_业务支出__委托贷款手续费支出_411003_2_411000 ("41103","委托贷款手续费支出","业务支出-委托贷款手续费支出","411003","2","411000","5","1"),

    ;



    private final String 科目号;
    private final String 科目简称;
    private final String 科目名称;
    private final String 科目控制字;
    private final String 科目级别;
    private final String 上级科目控制字;
    private final String 科目类型;
   private final String 借贷标志;

    public String get科目号() {
        return 科目号;
    }

    public String get科目简称() {
        return 科目简称;
    }

    public String get科目名称() {
        return 科目名称;
    }

    public String get科目控制字() {
        return 科目控制字;
    }

    public String get科目级别() {
        return 科目级别;
    }

    public String get上级科目控制字() {
        return 上级科目控制字;
    }

    public String get科目类型() {
        return 科目类型;
    }

    public String get借贷标志() {
        return 借贷标志;
    }

    E_科目字典_HX(String 科目号,
              String 科目简称,
              String 科目名称,
              String 科目控制字,
              String 科目级别,
              String 上级科目控制字,
              String 科目类型,
              String  借贷标志) {
        this.科目号 = 科目号;
        this.科目简称 = 科目简称;
        this.科目名称 = 科目名称;
        this.科目控制字 = 科目控制字;
        this.科目级别 = 科目级别;
        this.上级科目控制字 = 上级科目控制字;
        this.科目类型 = 科目类型;
        this.借贷标志 = 借贷标志;
    }
    public static E_科目字典_HX fromString(String text) {
        for (E_科目字典_HX status : E_科目字典_HX.values()) {
            if (status.get科目号().equals(text) ) {
                return status;
            }
        }
        throw new RuntimeException("no customer status " + text);
    }


}
