package org.ylgjj.loan.outputenum;

//import com.coalvalue.domain.pojo.ListItem;

/**
 * Created by silence on 2016/1/18.
 */
public enum HX摘要码信息表 {


    HX__1_S_单位正常汇缴入账_9101("9101","单位正常汇缴入账"),
    HX__2_S_单位预缴入账_9102("9102","单位预缴入账"),
    HX__3_S_单位预缴转汇缴入账_9103("9103","单位预缴转汇缴入账"),
    HX__4_S_银行存款转入公积金和预缴户_9105("9105","银行存款转入公积金和预缴户"),
    HX__5_S_银行存款和单位预缴户转入公积金_9106("9106","银行存款和单位预缴户转入公积金"),
    HX__6_S_自筹单位个人退缴至单位预缴户_9107("9107","自筹单位个人退缴至单位预缴户"),
    HX__7_S_财政单位个人退缴至单位预缴户_9108("9108","财政单位个人退缴至单位预缴户"),
    HX__8_S_自筹单位单位退款_9109("9109","自筹单位单位退款"),
    HX__9_S_财政单位退款_9110("9110","财政单位退款"),
    HX__10_S_归集转入资金不明挂账_9111("9111","归集转入资金不明挂账"),
    HX__11_S_单位预缴转移_9112("9112","单位预缴转移"),
    HX__12_S_公积金年度结息__无差额预提_9113("9113","公积金年度结息-无差额预提"),
    HX__13_S_公积金年度结息__有差额预提_9114("9114","公积金年度结息-有差额预提"),
    HX__14_S_公积金年度结息__无预提_9115("9115","公积金年度结息-无预提"),
    HX__15_S_发放公积金贷款_9116("9116","发放公积金贷款"),
    HX__16_S_柜台现金还款__正常___9117("9117","柜台现金还款（正常）"),
    HX__17_S_柜台现金还款__逾期___9118("9118","柜台现金还款（逾期）"),
    HX__18_S_公积金代扣还款__正常___9119("9119","公积金代扣还款（正常）"),
    HX__19_S_公积金代扣还款__逾期___9120("9120","公积金代扣还款（逾期）"),
    HX__20_S_贷款银行批量扣款__正常___9121("9121","贷款银行批量扣款（正常）"),
    HX__21_S_贷款银行批量扣款__逾期___9122("9122","贷款银行批量扣款（逾期）"),
    HX__22_S_贷款理赔__正常___9123("9123","贷款理赔（正常）"),
    HX__23_S_贷款理赔__逾期___9124("9124","贷款理赔（逾期）"),
    HX__24_S_转逾期_9125("9125","转逾期"),
    HX__25_S_贷款核销_9126("9126","贷款核销"),
    HX__26_S_结转业务收支_9127("9127","结转业务收支"),
    HX__27_S_结转业务支出_9128("9128","结转业务支出"),
    HX__28_S_增值收益分配_9129("9129","增值收益分配"),
    HX__29_S_上缴财政增值收益__中心管理用_9130("9130","上缴财政增值收益-中心管理用"),
    HX__30_S_上缴财政增值收益__城市廉租房建设资金_9131("9131","上缴财政增值收益-城市廉租房建设资金"),
    HX__31_S_银行公积金专户利息收入_9132("9132","银行公积金专户利息收入"),
    HX__32_S_银行增值收益专户利息收入_9133("9133","银行增值收益专户利息收入"),
    HX__33_S_公积金定期存款开户_9134("9134","公积金定期存款开户"),
    HX__34_S_增值收益定期存款开户_9135("9135","增值收益定期存款开户"),
    HX__35_S_公积金定期存款预提_9136("9136","公积金定期存款预提"),
    HX__36_S_增值收益定期存款预提_9137("9137","增值收益定期存款预提"),
    HX__37_S_公积金定期存款提前支取__期间无预提_9138("9138","公积金定期存款提前支取-期间无预提"),
    HX__38_S_公积金定期存款提前支取__期间有预提_9139("9139","公积金定期存款提前支取-期间有预提"),
    HX__39_S_增值收益定期存款提前支取__期间无预提_9140("9140","增值收益定期存款提前支取-期间无预提"),
    HX__40_S_增值收益定期存款提前支取__期间有预提_9141("9141","增值收益定期存款提前支取-期间有预提"),
    HX__41_S_公积金定期存款到期办理__期间无预提_9142("9142","公积金定期存款到期办理-期间无预提"),
    HX__42_S_公积金定期存款到期办理__期间有预提_9143("9143","公积金定期存款到期办理-期间有预提"),
    HX__43_S_增值收益定期存款到期办理__期间无预提_9144("9144","增值收益定期存款到期办理-期间无预提"),
    HX__44_S_增值收益定期存款到期办理__期间有预提_9145("9145","增值收益定期存款到期办理-期间有预提"),
    HX__45_S_购买国家债券_9146("9146","购买国家债券"),
    HX__46_S_预提国债专户利息_9147("9147","预提国债专户利息"),
    HX__47_S_国家债券提前兑付__期间有预提_9148("9148","国家债券提前兑付-期间有预提"),
    HX__48_S_国家债券提前兑付__期间无预提_9149("9149","国家债券提前兑付-期间无预提"),
    HX__49_S_国家债券到期收回本息__期间有预提_9150("9150","国家债券到期收回本息-期间有预提"),
    HX__50_S_国家债券到期收回本息__期间无预提_9151("9151","国家债券到期收回本息-期间无预提"),
    HX__51_S_住房公积金资金划转_9152("9152","住房公积金资金划转"),
    HX__52_S_住房公积金资金划转到增值收益_9153("9153","住房公积金资金划转到增值收益"),
    HX__53_S_增值收益资金划转_9154("9154","增值收益资金划转"),
    HX__54_S_增值收益资金划转到住房公积金_9155("9155","增值收益资金划转到住房公积金"),
    HX__55_S_支付归集手续费_9156("9156","支付归集手续费"),
    HX__56_S_支付个人贷款手续费_9157("9157","支付个人贷款手续费"),
    HX__57_S_支付项目贷款手续费_9158("9158","支付项目贷款手续费"),
    HX__58_S_支付抵押登记手续费_9159("9159","支付抵押登记手续费"),
    HX__59_S_提取公积金_9160("9160","提取公积金"),
    HX__60_S_提取销户_9161("9161","提取销户"),
    HX__61_S_公积金定期存款注销__冲账注销___9162("9162","公积金定期存款注销（冲账注销）"),
    HX__62_S_增值收益定期存款注销__冲账注销___9163("9163","增值收益定期存款注销（冲账注销）"),
    HX__63_S_填制凭证_9001("9001","填制凭证"),
    HX__64_S_增值收益购买国债_9164("9164","增值收益购买国债"),
    HX__65_S_增值收益国债提前兑付__无预提_9165("9165","增值收益国债提前兑付-无预提"),
    HX__66_S_增值收益国债到期收回本息__无预提_9166("9166","增值收益国债到期收回本息-无预提"),
    HX__67_S_增值收益国家债券冲账注销_9167("9167","增值收益国家债券冲账注销"),
    HX__68_S_国家债券冲账注销_9168("9168","国家债券冲账注销"),
    HX__69_S_单位开户_1001("1001","单位开户"),
    HX__70_S_单位转移__转出___1002("1002","单位转移(转出)"),
    HX__71_S_单位转移__转入___1003("1003","单位转移(转入)"),
    HX__72_S_单位销户_1011("1011","单位销户"),
    HX__73_S_单位预缴开户_1012("1012","单位预缴开户"),
    HX__74_S_预缴退缴_1014("1014","预缴退缴"),
    HX__75_S_预缴转移__转出___1015("1015","预缴转移(转出)"),
    HX__76_S_预缴转移__转入___1016("1016","预缴转移(转入)"),
    HX__77_S_单位预缴销户_1017("1017","单位预缴销户"),
    HX__78_S_个人开户_1118("1118","个人开户"),
    HX__79_S_个人转移__转出___1201("1201","个人转移(转出)"),
    HX__80_S_个人转移__转入___1202("1202","个人转移(转入)"),
    HX__81_S_个人托管__转出___1203("1203","个人托管(转出)"),
    HX__82_S_个人托管__转入___1204("1204","个人托管(转入)"),
    HX__83_S_个人并户__并出___1209("1209","个人并户(并出)"),
    HX__84_S_个人并户__并入___1210("1210","个人并户(并入)"),
    HX__85_S_预缴入账_1213("1213","预缴入账"),
    HX__86_S_汇缴入账_1219("1219","汇缴入账"),
    HX__87_S_正常全额补缴入账_1220("1220","正常全额补缴入账"),
    HX__88_S_正常差额补缴入账_1221("1221","正常差额补缴入账"),
    HX__89_S_不定额补缴入账_1222("1222","不定额补缴入账"),
    HX__90_S_调账__调出___1223("1223","调账(调出)"),
    HX__91_S_调账__调入___1224("1224","调账(调入)"),
    HX__92_S_部分提取_1228("1228","部分提取"),
    HX__93_S_销户提取_1229("1229","销户提取"),
    HX__94_S_年度结息_1231("1231","年度结息"),
    HX__95_S_销户结息_1233("1233","销户结息"),
    HX__96_S_提取登记撤销_1234("1234","提取登记撤销"),
    HX__97_S_提取依据号码修改_1235("1235","提取依据号码修改"),
    HX__98_S_提取依据内容修改_1236("1236","提取依据内容修改"),
    HX__99_S_提取依据登记簿修改_1237("1237","提取依据登记簿修改"),
    HX__100_S_约定提取协议新增_1238("1238","约定提取协议新增"),






;
    //private String inaccflag;//入账标志
//-,


    //   -
//    -



    private final String 编码;
    private final String 名称;





    private HX摘要码信息表(String 编码, String 名称) {
        this.编码 = 编码;
        this.名称 = 名称;


    }

    public String get编码() {
        return 编码;
    }

    public String get名称() {
        return 名称;
    }
   
/*
    public static 银行编码 fromString(String text) {
        for (银行编码 status : 银行编码.values()) {
            if (status.getText().equals(text) ) {
                return status;
            }
        }
        throw new RuntimeException("no customer status " + text);
    }

    public static 银行编码 fromInt(Integer text) {
        for (银行编码 status : 银行编码.values()) {
            if (status.getId().equals(text) ) {
                return status;
            }
        }
        throw new RuntimeException("no customer status " + text);
    }*/

}
