package org.ylgjj.loan.outputenum;

//import com.coalvalue.domain.pojo.ListItem;

import org.ylgjj.loan.pojo.ListItem;

import java.util.ArrayList;
import java.util.HashMap;
import java.util.List;
import java.util.Map;

import static org.springframework.hateoas.mvc.ControllerLinkBuilder.linkTo;
import static org.springframework.hateoas.mvc.ControllerLinkBuilder.methodOn;



/**
 * Created by silence on 2016/1/18.
 */
public enum StatisticalIndexCodeEnum {



    S_1_SEQ_暂存款笔数_AND_0301000101("0301","0301000101","暂存款笔数"," ","01","03","bm_khjg","机构","bm_dwjjlx","经济类型"," "," ","0","04",true),


    S_2_SEQ_实缴单位数_AND_0301000201("0301","0301000201","实缴单位数"," ","01","03","bm_khjg","机构","bm_dwjjlx","经济类型"," "," ","0","02",true),
    S_3_SEQ_实缴单位数__按年___AND_0301000202("0301","0301000202","实缴单位数(按年)"," ","01","06","bm_khjg","机构","bm_dwjjlx","经济类型"," "," ","0"," ",true),


    S_4_SEQ_未缴单位数_AND_0301000301("0301","0301000301","未缴单位数"," ","01","03","bm_khjg","机构","bm_dwjjlx","经济类型"," "," ","0","02",true),
    S_5_SEQ_实存单位数_AND_0301000401("0301","0301000401","实存单位数"," ","01","01","bm_khjg","机构","bm_dwjjlx","经济类型"," "," ","0","02",true),


    S_6_SEQ_新增单位数_AND_0301000501("0301","0301000501","新增单位数"," ","01","01","bm_khjg","机构","bm_dwjjlx","经济类型"," "," ","0","02",true),
    S_7_SEQ_销户单位数_AND_0301000601("0301","0301000601","销户单位数"," ","01","01","bm_khjg","机构","bm_dwjjlx","经济类型"," "," ","0","02",true),
    S_8_SEQ_封存单位数_AND_0301000701("0301","0301000701","封存单位数"," ","01","01","bm_khjg","机构","bm_dwjjlx","经济类型"," "," ","0","02",true),


    S_9_SEQ_缓缴单位数_AND_0301000801("0301","0301000801","缓缴单位数"," ","01","01","bm_khjg","机构","bm_dwjjlx","经济类型"," "," ","0","02",false),


    S_10_SEQ_比例超限单位数_AND_0301000901("0301","0301000901","比例超限单位数"," ","01","01","bm_khjg","机构","bm_dwjjlx","经济类型"," "," ","0","02",false),
    S_11_SEQ_缴暂存款净额_AND_0301001001("0301","0301001001","缴暂存款净额"," ","03","03","bm_khjg","机构","bm_dwjjlx","经济类型"," "," ","1"," ",true),


    S_12_SEQ_补缴单位数_AND_0301001101("0301","0301001101","补缴单位数"," ","01","03","bm_khjg","机构","bm_dwjjlx","经济类型"," "," ","0","02",true),


    S_13_SEQ_开户总单位数_AND_0301002101("0301","0301002101","开户总单位数"," ","01","01","bm_khjg","机构","bm_dwjjlx","经济类型"," "," ","0","02",true),


    S_14_SEQ_销户总单位数_AND_0301002201("0301","0301002201","销户总单位数"," ","01","01","bm_khjg","机构","bm_dwjjlx","经济类型"," "," ","0","02",true),
    S_15_SEQ_正常总单位数_AND_0301002301("0301","0301002301","正常总单位数"," ","01","01","bm_khjg","机构","bm_dwjjlx","经济类型"," "," ","0","02",true),
    S_16_SEQ_封存总单位数_AND_0301002401("0301","0301002401","封存总单位数"," ","01","01","bm_khjg","机构","bm_dwjjlx","经济类型"," "," ","0","02",true),


    S_17_SEQ_应缴人数_AND_0301003101("0301","0301003101","应缴人数"," ","02","03","bm_khjg","机构","bm_dwjjlx","经济类型"," "," ","0","02",true),
    S_18_SEQ_实缴人数_AND_0301003201("0301","0301003201","实缴人数"," ","02","03","bm_khjg","机构","bm_dwjjlx","经济类型"," "," ","0","02",true),


    S_19_SEQ_提取人数__非本市缴存职工___AND_0301003203("0301","0301003203","提取人数（非本市缴存职工）"," ","02","06","bm_khjg","机构","bm_bi_khnx","开户年限"," "," ","0"," ",true),
    S_20_SEQ_提取金额__收入水平___AND_0301003204("0301","0301003204","提取金额(收入水平)","提取金额(收入水平包含低收入、中收入、高收入)","25","01","bm_khjg","机构","bm_bi_srsp","收入水平"," "," ","1"," ",true),


    S_21_SEQ_新开户职工数__非本市缴存职工___AND_0301003205("0301","0301003205","新开户职工数（非本市缴存职工）"," ","02","06","bm_khjg","机构","bm_bi_khnx","开户年限"," "," ","0"," ",true),


    S_22_SEQ_实缴人数__按年___AND_0301003206("0301","0301003206","实缴人数(按年)"," ","02","06","bm_khjg","机构","bm_dwjjlx","经济类型"," "," ","0"," ",false),



    S_23_SEQ_提取金额__非本市缴存职工___AND_0301003207("0301","0301003207","提取金额（非本市缴存职工）"," ","04","01","bm_khjg","机构"," "," "," "," ","1"," ",true),
    S_24_SEQ_提取人次__收入水平___AND_0301003208("0301","0301003208","提取人次(收入水平)","提取人次(收入水平包含低收入、中收入、高收入)","25","03","bm_khjg","机构","bm_bi_srsp","收入水平"," "," ","0"," ",true),




    S_25_SEQ_实缴人数__个人缴存基数___AND_0301003209("0301","0301003209","实缴人数(个人缴存基数)"," ","02","03","bm_khjg","机构","bm_dwjjlx","经济类型"," "," ","0"," ",false),
    S_26_SEQ_实缴人数__月缴存额___AND_0301003210("0301","0301003210","实缴人数(月缴存额)"," ","02","03","bm_khjg","机构","bm_dwjjlx","经济类型"," "," ","0"," ",false),


    S_27_SEQ_缴存金额__非本市缴存职工___AND_0301003211("0301","0301003211","缴存金额（非本市缴存职工）"," ","03","06","bm_khjg","机构","bm_bi_khnx","开户年限"," "," ","1"," ",true),



    S_28_SEQ_实缴人次_AND_0301003301("0301","0301003301","实缴人次"," ","02","03","bm_khjg","机构","bm_dwjjlx","经济类型"," "," ","0","02",false),



    S_29_SEQ_补缴人数_AND_0301003401("0301","0301003401","补缴人数"," ","02","03","bm_khjg","机构","bm_dwjjlx","经济类型"," "," ","0","02",true),
    S_30_SEQ_未缴人数_AND_0301003501("0301","0301003501","未缴人数"," ","02","03","bm_khjg","机构","bm_dwjjlx","经济类型"," "," ","0","02",true),



    S_31_SEQ_新增人数_AND_0301003601("0301","0301003601","新增人数"," ","02","01","bm_khjg","机构","bm_dwjjlx","经济类型"," "," ","0","02",true),
    S_32_SEQ_新增人数__非本市缴存职工___AND_0301003602("0301","0301003602","新增人数（非本市缴存职工）"," ","02","01","bm_khjg","机构"," "," "," "," ","0"," ",true),
    S_33_SEQ_封存人数_AND_0301003701("0301","0301003701","封存人数"," ","02","03","bm_khjg","机构","bm_dwjjlx","经济类型"," "," ","0","02",true),
    S_34_SEQ_销户人数_AND_0301003801("0301","0301003801","销户人数"," ","02","03","bm_khjg","机构","bm_dwjjlx","经济类型"," "," ","0","02",true),


    S_35_SEQ_历史累计销户人数_AND_0301003802("0301","0301003802","历史累计销户人数"," ","05","03","bm_khjg","机构","bm_dwjjlx","经济类型"," "," ","0","02",true),











    S_36_SEQ_提取人数_AND_0301003901("0301","0301003901","提取人数"," ","02","03","bm_khjg","机构","bm_dwjjlx","经济类型"," "," ","0","02",true),
    S_37_SEQ_提取人数__提取原因___AND_0301003911("0301","0301003911","提取人数(提取原因)"," ","02","03","bm_khjg","机构","bm_gz_tqyy","提取原因"," "," ","0","02",true),
    S_38_SEQ_提取人次_AND_0301004001("0301","0301004001","提取人次"," ","02","03","bm_khjg","机构","bm_dwjjlx","经济类型"," "," ","0","02",true),
    S_39_SEQ_提取人次__提取原因___AND_0301004011("0301","0301004011","提取人次(提取原因)"," ","02","03","bm_khjg","机构","bm_gz_tqyy","提取原因"," "," ","0","02",true),











    S_40_SEQ_外部转入人数_AND_0301004101("0301","0301004101","外部转入人数"," ","02","03","bm_khjg","机构","bm_dwjjlx","经济类型"," "," ","0","02",true),
    S_41_SEQ_外部转出人数_AND_0301004201("0301","0301004201","外部转出人数"," ","02","03","bm_khjg","机构","bm_dwjjlx","经济类型"," "," ","0","02",true),
    S_42_SEQ_实存人数_AND_0301005101("0301","0301005101","实存人数"," ","02","01","bm_khjg","机构","bm_dwjjlx","经济类型"," "," ","0","02",false),




    S_43_SEQ_开户总人数_AND_0301005201("0301","0301005201","开户总人数"," ","02","01","bm_khjg","机构","bm_dwjjlx","经济类型"," "," ","0","02",true),
    S_44_SEQ_正常总人数_AND_0301005301("0301","0301005301","正常总人数"," ","02","01","bm_khjg","机构","bm_dwjjlx","经济类型"," "," ","0","02",true),
    S_45_SEQ_封存总人数_AND_0301005401("0301","0301005401","封存总人数"," ","02","01","bm_khjg","机构","bm_dwjjlx","经济类型"," "," ","0","02",true),
    S_46_SEQ_销户总人数_AND_0301005501("0301","0301005501","销户总人数"," ","02","01","bm_khjg","机构","bm_dwjjlx","经济类型"," "," ","0","02",true),
    S_47_SEQ_冻结总人数_AND_0301005601("0301","0301005601","冻结总人数"," ","02","01","bm_khjg","机构","bm_dwjjlx","经济类型"," "," ","0","02",true),


    S_48_SEQ_应归集额_AND_0301007101("0301","0301007101","应归集额"," ","03","03","bm_khjg","机构","bm_dwjjlx","经济类型"," "," ","1","01",true),
    S_49_SEQ_实归集额_AND_0301007201("0301","0301007201","实归集额"," ","03","01","bm_khjg","机构","bm_dwjjlx","经济类型"," "," ","1","01",true),


    S_50_SEQ_实归集额__缴存基数___AND_0301007202("0301","0301007202","实归集额(缴存基数)"," ","03","01","bm_khjg","机构","bm_dwjjlx","经济类型"," "," ","1"," ",false),
    S_51_SEQ_实归集额__月缴存额___AND_0301007203("0301","0301007203","实归集额(月缴存额)"," ","03","01","bm_khjg","机构","bm_dwjjlx","经济类型"," "," ","1"," ",false),


    S_52_SEQ_补缴金额_AND_0301007301("0301","0301007301","补缴金额"," ","03","03","bm_khjg","机构","bm_dwjjlx","经济类型"," "," ","1","01",true),






    S_53_SEQ_提取本金_AND_0301007601("0301","0301007601","提取本金"," ","04","01","bm_khjg","机构","bm_dwjjlx","经济类型"," "," ","1","01",true),
    S_54_SEQ_提取本金__跨中心转出___AND_0301007602("0301","0301007602","提取本金(跨中心转出)"," ","04","01","bm_khjg","机构","bm_dwjjlx","经济类型"," "," ","1"," ",false),
    S_55_SEQ_提取本金__提取原因___AND_0301007611("0301","0301007611","提取本金(提取原因)"," ","04","01","bm_khjg","机构","bm_gz_tqyy","提取原因"," "," ","1","01",true),
    S_56_SEQ_提取利息_AND_0301007701("0301","0301007701","提取利息"," ","04","01","bm_khjg","机构","bm_dwjjlx","经济类型"," "," ","1","01",true),
    S_57_SEQ_提取利息__提取原因___AND_0301007711("0301","0301007711","提取利息(提取原因)"," ","04","01","bm_khjg","机构","bm_gz_tqyy","提取原因"," "," ","1","01",true),






    S_58_SEQ_外部转入金额_AND_0301007801("0301","0301007801","外部转入金额"," ","03","01","bm_khjg","机构","bm_dwjjlx","经济类型"," "," ","1","01",true),
    S_59_SEQ_外部转出金额__本金___AND_0301007901("0301","0301007901","外部转出金额(本金)"," ","04","01","bm_khjg","机构","bm_dwjjlx","经济类型"," "," ","1","01",true),
    S_60_SEQ_外部转出金额__利息___AND_0301007902("0301","0301007902","外部转出金额(利息)"," ","04","01","bm_khjg","机构","bm_dwjjlx","经济类型"," "," ","1","01",true),
    S_61_SEQ_结转利息额_AND_0301008001("0301","0301008001","结转利息额"," ","03","01","bm_khjg","机构","bm_dwjjlx","经济类型"," "," ","1","01",false),
    S_62_SEQ_结转利息额__正常职工结转___AND_0301008002("0301","0301008002","结转利息额（正常职工结转）"," ","03","01","bm_khjg","机构","bm_dwjjlx","经济类型"," "," ","1","01",false),
    S_63_SEQ_结转利息额__非正常职工结转___AND_0301008003("0301","0301008003","结转利息额（非正常职工结转）"," ","03","01","bm_khjg","机构","bm_dwjjlx","经济类型"," "," ","1","01",false),


    S_64_SEQ_非正常账户余额_AND_0301008004("0301","0301008004","非正常账户余额"," ","03","03","bm_khjg","机构","bm_dwjjlx","经济类型"," "," ","1","03",true),


    S_65_SEQ_归集余额_AND_0301008101("0301","0301008101","归集余额"," ","03","01","bm_khjg","机构","bm_dwjjlx","经济类型"," "," ","1","01",true),


    S_66_SEQ_暂存款余额_AND_0301008102("0301","0301008102","暂存款余额"," ","03","01","bm_khjg","机构","bm_dwjjlx","经济类型"," "," ","1","01",true),


    S_67_SEQ_历史累计归集额_AND_0301010101("0301","0301010101","历史累计归集额"," ","05","01","bm_khjg","机构","bm_dwjjlx","经济类型"," "," ","1","01",true),
    S_68_SEQ_历史累计补缴额_AND_0301010201("0301","0301010201","历史累计补缴额"," ","05","03","bm_khjg","机构","bm_dwjjlx","经济类型"," "," ","1","01",true),


    S_69_SEQ_历史累计外部转入额_AND_0301010501("0301","0301010501","历史累计外部转入额"," ","05","03","bm_khjg","机构","bm_dwjjlx","经济类型"," "," ","1","01",true),
    S_70_SEQ_历史累计外部转出额_AND_0301010601("0301","0301010601","历史累计外部转出额"," ","05","03","bm_khjg","机构","bm_dwjjlx","经济类型"," "," ","1","01",true),


    S_71_SEQ_历史累计提取额_AND_0301010701("0301","0301010701","历史累计提取额"," ","05","01","bm_khjg","机构","bm_dwjjlx","经济类型"," "," ","1","01",true),
    S_72_SEQ_历史累计提取额__提取原因___AND_0301010711("0301","0301010711","历史累计提取额(提取原因)"," ","05","01","bm_khjg","机构","bm_gz_tqyy","提取原因"," "," ","1","01",true),


    S_73_SEQ_历史累计归集人数_AND_0301010801("0301","0301010801","历史累计归集人数"," ","05","01","bm_khjg","机构","bm_dwjjlx","经济类型"," "," ","0","02",true),
    S_74_SEQ_历史累计补缴人数_AND_0301010901("0301","0301010901","历史累计补缴人数"," ","05","03","bm_khjg","机构","bm_dwjjlx","经济类型"," "," ","0","02",true),


    S_75_SEQ_历史累计提取人数_AND_0301011001("0301","0301011001","历史累计提取人数"," ","05","03","bm_khjg","机构","bm_dwjjlx","经济类型"," "," ","0","02",true),
    S_76_SEQ_历史累计提取人数__提取原因___AND_0301011002("0301","0301011002","历史累计提取人数(提取原因)"," ","05","03","bm_khjg","机构","bm_gz_tqyy","提取原因"," "," ","0","02",true),


    S_77_SEQ_历史累计单位账户数_AND_0301011003("0301","0301011003","历史累计单位账户数"," ","05","03","bm_khjg","机构","bm_dwjjlx","经济类型"," "," ","0","03",true),
    S_78_SEQ_历史累计个人账户数_AND_0301011004("0301","0301011004","历史累计个人账户数"," ","05","03","bm_khjg","机构","bm_dwjjlx","经济类型"," "," ","0","03",true),



    S_79_SEQ_住房公积金缴存率_AND_0301020101("0301","0301020101","住房公积金缴存率"," ","06","06"," "," "," "," "," "," ","1"," ",true),
    S_80_SEQ_住房公积金覆盖率_AND_0301020201("0301","0301020201","住房公积金覆盖率"," ","06","06"," "," "," "," "," "," ","1"," ",true),
    S_81_SEQ_住房公积金归集增长率_AND_0301020301("0301","0301020301","住房公积金归集增长率"," ","06","06"," "," "," "," "," "," ","1"," ",true),
    S_82_SEQ_提取额占缴存额比重_AND_0301020401("0301","0301020401","提取额占缴存额比重"," ","06","06"," "," "," "," "," "," ","1"," ",true),
    S_83_SEQ_住房公积金使用率_AND_0301020501("0301","0301020501","住房公积金使用率"," ","06","03"," "," "," "," "," "," ","1"," ",true),



    S_84_SEQ_职工人数__收入水平___AND_0301020502("0301","0301020502","职工人数(收入水平)","职工人数(收入水平包含低收入、中收入、高收入)","25","06","bm_khjg","机构","bm_bi_srsp","收入水平"," "," ","0","02",false),
    S_85_SEQ_当年缴存额__收入水平___AND_0301020503("0301","0301020503","当年缴存额(收入水平)","当年缴存额(收入水平包含低收入、中收入、高收入)","25","03","bm_khjg","机构","bm_bi_srsp","收入水平"," "," ","1"," ",false),
    S_86_SEQ_新开户职工数__收入水平___AND_0301020506("0301","0301020506","新开户职工数(收入水平)","新开户职工数(收入水平包含低收入、中收入、高收入)","25","06","bm_khjg","机构","bm_bi_srsp","收入水平"," "," ","0"," ",false),
    S_87_SEQ_当年缴存人数__收入水平___AND_0301020507("0301","0301020507","当年缴存人数(收入水平)","当年缴存人数(收入水平包含低收入、中收入、高收入)","25","06","bm_khjg","机构","bm_bi_srsp","收入水平"," "," ","1"," ",false),


    S_88_SEQ_发放额_AND_0302000101("0302","0302000101","发放额"," ","07","01","bm_khjg","机构","bm_yhbm","银行名称"," "," ","1","01",true),
    S_89_SEQ_发放额__5年以内含___AND_0302000102("0302","0302000102","发放额（5年以内含）"," ","07","01","bm_khjg","机构","bm_yhbm","银行名称"," "," ","1","01",true),
    S_90_SEQ_发放额__5年以上___AND_0302000103("0302","0302000103","发放额（5年以上）"," ","07","01","bm_khjg","机构","bm_yhbm","银行名称"," "," ","1","01",true),
    S_91_SEQ_发放额__贷款年限___AND_0302000105("0302","0302000105","发放额(贷款年限)"," ","22","03","bm_khjg","机构","bm_bi_dknx","贷款年限"," "," ","1"," ",true),
    S_92_SEQ_发放额__担保方式新___AND_0302000106("0302","0302000106","发放额(担保方式新)"," ","23","03","bm_khjg","机构","bm_bi_dkdblx","担保方式新"," "," ","0"," ",true),
    S_93_SEQ_发放额__购房面积___AND_0302000107("0302","0302000107","发放额(购房面积)"," ","20","03","bm_khjg","机构","bm_bi_gfmj","购房面积"," "," ","1"," ",true),
    S_94_SEQ_发放额__单位性质___AND_0302000108("0302","0302000108","发放额(单位性质)"," ","23","03","bm_khjg","机构","bm_dwjjlx","单位性质"," "," ","0"," ",true),
    S_95_SEQ_发放额__非本市缴存职工开户年限___AND_0302000109("0302","0302000109","发放额(非本市缴存职工开户年限)"," ","23","06","bm_khjg","机构","bm_bi_khnx","开户年限"," "," ","0"," ",true),
    S_96_SEQ_发放额__缴存人数___AND_0302000110("0302","0302000110","发放额(缴存人数)"," ","23","03","bm_khjg","机构","bm_bi_jcrs","缴存人数"," "," ","0"," ",true),
    S_97_SEQ_发放额__贷款次数___AND_0302000111("0302","0302000111","发放额(贷款次数)"," ","23","03","bm_khjg","机构","bm_bi_dkcs","贷款次数"," "," ","0"," ",true),
    S_98_SEQ_发放额__借款人年龄___AND_0302000112("0302","0302000112","发放额(借款人年龄)"," ","23","03","bm_khjg","机构","bm_bi_khnx","开户年限"," "," ","0"," ",true),
    S_99_SEQ_发放额__贷款用途___AND_0302000113("0302","0302000113","发放额(贷款用途)"," ","23","03","bm_khjg","机构","bm_bi_dkyt","贷款用途"," "," ","0"," ",true),
    S_100_SEQ_发放额__资金来源___AND_0302000114("0302","0302000114","发放额(资金来源)"," ","23","03","bm_khjg","机构","bm_bi_zjly","资金来源"," "," ","0"," ",true),
    S_101_SEQ_发放额__贷款金额与房屋价格占比___AND_0302000115("0302","0302000115","发放额(贷款金额与房屋价格占比)"," ","23","03","bm_khjg","机构","bm_bi_gjjdkbl","贷款金额与房屋价格占比"," "," ","0"," ",true),
    S_102_SEQ_发放额__还款方式___AND_0302000116("0302","0302000116","发放额(还款方式)"," ","23","03","bm_khjg","机构","BM_GD_DKHKFS","还款方式"," "," ","0"," ",true),
    S_103_SEQ_发放额__贷款时缴存年限___AND_0302000117("0302","0302000117","发放额(贷款时缴存年限)"," ","23","03","bm_khjg","机构","bm_bi_dkjcnx","贷款时缴存年限"," "," ","0"," ",true),
    S_104_SEQ_发放额__收入水平___AND_0302000119("0302","0302000119","发放额(收入水平)"," ","09","03","bm_khjg","机构","bm_bi_srsp","收入水平"," "," ","0"," ",true),




    S_105_SEQ_当年发放异地贷款金额_AND_0302000120("0302","0302000120","当年发放异地贷款金额"," ","09","06","bm_khjg","机构"," "," "," "," ","0"," ",true),
    S_106_SEQ_累计发放异地贷款总额_AND_0302000121("0302","0302000121","累计发放异地贷款总额"," ","09","03","bm_khjg","机构"," "," "," "," ","0"," ",true),














    S_107_SEQ_回收额_AND_0302000201("0302","0302000201","回收额"," ","08","01","bm_khjg","机构","bm_yhbm","银行名称"," "," ","1","01",true),
    S_108_SEQ_回收额__正常___AND_0302000202("0302","0302000202","回收额（正常）"," ","08","01","bm_khjg","机构","bm_yhbm","银行名称"," "," ","1","01",true),
    S_109_SEQ_回收额__逾期___AND_0302000203("0302","0302000203","回收额（逾期）"," ","08","01","bm_khjg","机构","bm_yhbm","银行名称"," "," ","1","01",true),
    S_110_SEQ_回收额__提前还本___AND_0302000204("0302","0302000204","回收额（提前还本）"," ","08","01","bm_khjg","机构","bm_yhbm","银行名称"," "," ","1","01",true),
    S_111_SEQ_回收额__正常还清___AND_0302000205("0302","0302000205","回收额（正常还清）"," ","08","01","bm_khjg","机构","bm_yhbm","银行名称"," "," ","1","01",true),
    S_112_SEQ_回收额__提前还清___AND_0302000206("0302","0302000206","回收额（提前还清）"," ","08","01","bm_khjg","机构","bm_yhbm","银行名称"," "," ","1","01",true),
    S_113_SEQ_回收额__本行回收___AND_0302000207("0302","0302000207","回收额（本行回收）"," ","08","01","bm_khjg","机构","bm_yhbm","银行名称"," "," ","1","01",true),
    S_114_SEQ_回收额__他行回收___AND_0302000208("0302","0302000208","回收额（他行回收）"," ","08","01","bm_khjg","机构","bm_yhbm","银行名称"," "," ","1","01",true),
    S_115_SEQ_回收额__5年以内含___AND_0302000210("0302","0302000210","回收额（5年以内含）"," ","08","01","bm_khjg","机构","bm_yhbm","银行名称"," "," ","1","01",true),
    S_116_SEQ_回收额__5年以上___AND_0302000211("0302","0302000211","回收额（5年以上）"," ","08","01","bm_khjg","机构","bm_yhbm","银行名称"," "," ","1","01",true),
    S_117_SEQ_回收额__现金___AND_0302000212("0302","0302000212","回收额（现金）"," ","08","01","bm_khjg","机构","bm_yhbm","银行名称"," "," ","1","01",true),
    S_118_SEQ_回收额__冲还贷___AND_0302000213("0302","0302000213","回收额（冲还贷）"," ","08","01","bm_khjg","机构","bm_yhbm","银行名称"," "," ","1","01",false),












    S_119_SEQ_结清额_AND_0302000301("0302","0302000301","结清额"," ","09","01","bm_khjg","机构","bm_yhbm","银行名称"," "," ","1","01",true),
    S_120_SEQ_结清额__正常___AND_0302000302("0302","0302000302","结清额（正常）"," ","09","01","bm_khjg","机构","bm_yhbm","银行名称"," "," ","1","01",true),
    S_121_SEQ_结清额__提前___AND_0302000303("0302","0302000303","结清额（提前）"," ","09","01","bm_khjg","机构","bm_yhbm","银行名称"," "," ","1","01",true),
    S_122_SEQ_结清额__逾期___AND_0302000304("0302","0302000304","结清额（逾期）"," ","09","01","bm_khjg","机构","bm_yhbm","银行名称"," "," ","1","01",true),
    S_123_SEQ_结清额__贷款年限___AND_0302000305("0302","0302000305","结清额(贷款年限)"," ","09","03","bm_khjg","机构","bm_bi_dknx","贷款年限"," "," ","0"," ",true),




    S_124_SEQ_回收利息_AND_0302000401("0302","0302000401","回收利息"," ","10","01","bm_khjg","机构","bm_yhbm","银行名称"," "," ","1","01",true),
    S_125_SEQ_回收利息__正常___AND_0302000402("0302","0302000402","回收利息（正常）"," ","10","01","bm_khjg","机构","bm_yhbm","银行名称"," "," ","1","01",true),
    S_126_SEQ_回收利息__逾期___AND_0302000403("0302","0302000403","回收利息（逾期）"," ","10","01","bm_khjg","机构","bm_yhbm","银行名称"," "," ","1","01",true),
    S_127_SEQ_回收利息__提前还本___AND_0302000404("0302","0302000404","回收利息（提前还本）"," ","10","01","bm_khjg","机构","bm_yhbm","银行名称"," "," ","1","01",true),
    S_128_SEQ_回收利息__正常还清___AND_0302000405("0302","0302000405","回收利息（正常还清）"," ","10","01","bm_khjg","机构","bm_yhbm","银行名称"," "," ","1","01",true),
    S_129_SEQ_回收利息__提前还清___AND_0302000406("0302","0302000406","回收利息（提前还清）"," ","10","01","bm_khjg","机构","bm_yhbm","银行名称"," "," ","1","01",true),
    S_130_SEQ_回收利息__本行回收___AND_0302000407("0302","0302000407","回收利息（本行回收）"," ","10","01","bm_khjg","机构","bm_yhbm","银行名称"," "," ","1","01",true),
    S_131_SEQ_回收利息__他行回收___AND_0302000408("0302","0302000408","回收利息（他行回收）"," ","10","01","bm_khjg","机构","bm_yhbm","银行名称"," "," ","1","01",true),
    S_132_SEQ_回收利息__5年以下含___AND_0302000410("0302","0302000410","回收利息（5年以下含）"," ","10","01","bm_khjg","机构","bm_yhbm","银行名称"," "," ","1","01",true),
    S_133_SEQ_回收利息__5年以上___AND_0302000411("0302","0302000411","回收利息（5年以上）"," ","10","01","bm_khjg","机构","bm_yhbm","银行名称"," "," ","1","01",true),



    S_134_SEQ_应收本息_AND_0302000601("0302","0302000601","应收本息"," ","11","01","bm_khjg","机构","bm_yhbm","银行名称"," "," ","1","01",true),
    S_135_SEQ_应收本金_AND_0302000602("0302","0302000602","应收本金"," ","11","01","bm_khjg","机构","bm_yhbm","银行名称"," "," ","1","01",true),
    S_136_SEQ_应收利息_AND_0302000603("0302","0302000603","应收利息"," ","11","01","bm_khjg","机构","bm_yhbm","银行名称"," "," ","1","01",true),



    S_137_SEQ_逾期本息__本期发生___AND_0302000701("0302","0302000701","逾期本息（本期发生）"," ","12","01","bm_khjg","机构","bm_yhbm","银行名称"," "," ","1","01",true),
    S_138_SEQ_逾期本金__本期发生___AND_0302000702("0302","0302000702","逾期本金（本期发生）"," ","12","01","bm_khjg","机构","bm_yhbm","银行名称"," "," ","1","01",true),
    S_139_SEQ_逾期利息__本期发生___AND_0302000703("0302","0302000703","逾期利息（本期发生）"," ","12","01","bm_khjg","机构","bm_yhbm","银行名称"," "," ","1","01",true),



    S_140_SEQ_贷款余额_AND_0302000801("0302","0302000801","贷款余额"," ","13","01","bm_khjg","机构","bm_yhbm","银行名称"," "," ","1","01",true),
    S_141_SEQ_贷款余额__5年以内含___AND_0302000802("0302","0302000802","贷款余额（5年以内含）"," ","13","01","bm_khjg","机构","bm_yhbm","银行名称"," "," ","1","01",true),
    S_142_SEQ_贷款余额__5年以上___AND_0302000803("0302","0302000803","贷款余额（5年以上）"," ","13","01","bm_khjg","机构","bm_yhbm","银行名称"," "," ","1","01",true),


    S_143_SEQ_异地贷款余额_AND_0302000804("0302","0302000804","异地贷款余额"," ","13","01","bm_khjg","机构"," "," "," "," ","1"," ",true),


    S_144_SEQ_贷款余额__逾期期次___AND_0302000808("0302","0302000808","贷款余额(逾期期次)"," ","13","01","bm_khjg","机构","bm_bi_yqqc","逾期期次"," "," ","1","01",true),




    S_145_SEQ_目前逾期本息_AND_0302000901("0302","0302000901","目前逾期本息"," ","12","01","bm_khjg","机构","bm_yhbm","银行名称"," "," ","1","01",true),
    S_146_SEQ_目前逾期本金_AND_0302000902("0302","0302000902","目前逾期本金"," ","12","01","bm_khjg","机构","bm_yhbm","银行名称"," "," ","1","01",true),
    S_147_SEQ_目前逾期利息_AND_0302000903("0302","0302000903","目前逾期利息"," ","12","01","bm_khjg","机构","bm_yhbm","银行名称"," "," ","1","01",true),
    S_148_SEQ_目前逾期本息__按期次分类___AND_0302000911("0302","0302000911","目前逾期本息（按期次分类）"," ","12","01","bm_khjg","机构","bm_yhbm","银行名称","bm_bi_yqqc","逾期期次","1","01",true),
    S_149_SEQ_目前逾期本金__按期次分类___AND_0302000912("0302","0302000912","目前逾期本金（按期次分类）"," ","12","01","bm_khjg","机构","bm_yhbm","银行名称","bm_bi_yqqc","逾期期次","1","01",true),
    S_150_SEQ_目前逾期利息__按期次分类___AND_0302000913("0302","0302000913","目前逾期利息（按期次分类）"," ","12","01","bm_khjg","机构","bm_yhbm","银行名称","bm_bi_yqqc","逾期期次","1","01",true),






    S_151_SEQ_发放户数_AND_0302002001("0302","0302002001","发放户数"," ","07","01","bm_khjg","机构","bm_yhbm","银行名称"," "," ","0","03",true),
    S_152_SEQ_发放户数__5年以内含___AND_0302002002("0302","0302002002","发放户数（5年以内含）"," ","07","01","bm_khjg","机构","bm_yhbm","银行名称"," "," ","0","03",true),
    S_153_SEQ_发放户数__5年以上___AND_0302002003("0302","0302002003","发放户数（5年以上）"," ","07","01","bm_khjg","机构","bm_yhbm","银行名称"," "," ","0","03",true),

    S_154_SEQ_发放户数__贷款年限___AND_0302002005("0302","0302002005","发放户数(贷款年限)"," ","22","03","bm_khjg","机构","bm_bi_dknx","贷款年限"," "," ","0"," ",true),
    S_155_SEQ_发放户数__担保方式新___AND_0302002006("0302","0302002006","发放户数(担保方式新)"," ","23","03","bm_khjg","机构","bm_bi_dkdblx","担保方式新"," "," ","0"," ",true),
    S_156_SEQ_发放户数__单位性质___AND_0302002007("0302","0302002007","发放户数(单位性质)"," ","23","03","bm_khjg","机构","bm_dwjjlx","单位性质"," "," ","0"," ",true),
    S_157_SEQ_发放户数__非本市缴存职工开户年限___AND_0302002008("0302","0302002008","发放户数(非本市缴存职工开户年限)"," ","23","06","bm_khjg","机构","bm_bi_khnx","开户年限"," "," ","0"," ",true),
    S_158_SEQ_发放户数__贷款次数___AND_0302002009("0302","0302002009","发放户数(贷款次数)"," ","23","03","bm_khjg","机构","bm_bi_dkcs","贷款次数"," "," ","0"," ",true),
    S_159_SEQ_发放户数__借款人年龄___AND_0302002010("0302","0302002010","发放户数(借款人年龄)"," ","23","03","bm_khjg","机构","bm_bi_khnx","开户年限"," "," ","0"," ",true),
    S_160_SEQ_发放户数__还款方式___AND_0302002011("0302","0302002011","发放户数(还款方式)"," ","23","03","bm_khjg","机构","BM_GD_DKHKFS","还款方式"," "," ","0"," ",true),
    S_161_SEQ_发放户数__贷款金额与房屋价格占比___AND_0302002012("0302","0302002012","发放户数(贷款金额与房屋价格占比)"," ","23","03","bm_khjg","机构","bm_bi_gjjdkbl","贷款金额与房屋价格占比"," "," ","0"," ",true),
    S_162_SEQ_发放户数__资金来源___AND_0302002013("0302","0302002013","发放户数(资金来源)"," ","23","03","bm_khjg","机构","bm_bi_zjly","资金来源"," "," ","0"," ",true),
    S_163_SEQ_发放户数__贷款用途___AND_0302002014("0302","0302002014","发放户数(贷款用途)"," ","23","03","bm_khjg","机构","bm_bi_dkyt","贷款用途"," "," ","0"," ",true),
    S_164_SEQ_发放户数__缴存人数___AND_0302002015("0302","0302002015","发放户数(缴存人数)"," ","23","03","bm_khjg","机构","bm_bi_jcrs","缴存人数"," "," ","0"," ",true),
    S_165_SEQ_发放户数__贷款时缴存年限___AND_0302002016("0302","0302002016","发放户数(贷款时缴存年限)"," ","23","03","bm_khjg","机构","bm_bi_dkjcnx","贷款时缴存年限"," "," ","0"," ",true),
    S_166_SEQ_发放户数__收入水平___AND_0302002018("0302","0302002018","发放户数(收入水平)"," ","09","03","bm_khjg","机构","bm_bi_srsp","收入水平"," "," ","0"," ",true),




    S_167_SEQ_当年发放异地贷款笔数_AND_0302002019("0302","0302002019","当年发放异地贷款笔数"," ","09","06","bm_khjg","机构"," "," "," "," ","0"," ",true),
    S_168_SEQ_累计发放异地贷款笔数_AND_0302002020("0302","0302002020","累计发放异地贷款笔数"," ","09","03","bm_khjg","机构"," "," "," "," ","0"," ",true),


    S_169_SEQ_回收户数_AND_0302002101("0302","0302002101","回收户数"," ","08","03","bm_khjg","机构","bm_yhbm","银行名称"," "," ","0","03",true),
    S_170_SEQ_回收户数__正常___AND_0302002102("0302","0302002102","回收户数（正常）"," ","08","03","bm_khjg","机构","bm_yhbm","银行名称"," "," ","0","03",true),
    S_171_SEQ_回收户数__逾期___AND_0302002103("0302","0302002103","回收户数（逾期）"," ","08","03","bm_khjg","机构","bm_yhbm","银行名称"," "," ","0","03",true),
    S_172_SEQ_回收户数__提前还本___AND_0302002104("0302","0302002104","回收户数（提前还本）"," ","08","03","bm_khjg","机构","bm_yhbm","银行名称"," "," ","0","03",true),
    S_173_SEQ_回收户数__正常还清___AND_0302002105("0302","0302002105","回收户数（正常还清）"," ","08","03","bm_khjg","机构","bm_yhbm","银行名称"," "," ","0","03",true),
    S_174_SEQ_回收户数__提前还清___AND_0302002106("0302","0302002106","回收户数（提前还清）"," ","08","03","bm_khjg","机构","bm_yhbm","银行名称"," "," ","0","03",true),
    S_175_SEQ_回收户数__本行回收___AND_0302002107("0302","0302002107","回收户数（本行回收）"," ","08","03","bm_khjg","机构","bm_yhbm","银行名称"," "," ","0","03",true),
    S_176_SEQ_回收户数__他行回收___AND_0302002108("0302","0302002108","回收户数（他行回收）"," ","08","03","bm_khjg","机构","bm_yhbm","银行名称"," "," ","0","03",true),


    S_177_SEQ_结清户数_AND_0302002201("0302","0302002201","结清户数"," ","09","03","bm_khjg","机构","bm_yhbm","银行名称"," "," ","0","03",true),
    S_178_SEQ_结清户数__正常___AND_0302002202("0302","0302002202","结清户数（正常）"," ","09","03","bm_khjg","机构","bm_yhbm","银行名称"," "," ","0","03",true),
    S_179_SEQ_结清户数__提前___AND_0302002203("0302","0302002203","结清户数（提前）"," ","09","03","bm_khjg","机构","bm_yhbm","银行名称"," "," ","0","03",true),
    S_180_SEQ_结清户数__贷款年限___AND_0302002204("0302","0302002204","结清户数(贷款年限)"," ","09","03","bm_khjg","机构","bm_bi_dknx","贷款年限"," "," ","0"," ",true),


    S_181_SEQ_目前逾期户数_AND_0302002301("0302","0302002301","目前逾期户数"," ","12","01","bm_khjg","机构","bm_yhbm","银行名称"," "," ","0","03",true),
    S_182_SEQ_目前逾期户数__按期次分类___AND_0302002311("0302","0302002311","目前逾期户数（按期次分类）"," ","12","01","bm_khjg","机构","bm_yhbm","银行名称","bm_bi_yqqc","逾期期次","0","03",true),




    S_183_SEQ_历史累计发放额_AND_0302010101("0302","0302010101","历史累计发放额"," ","14","01","bm_khjg","机构","bm_yhbm","银行名称"," "," ","1","01",true),
    S_184_SEQ_历史累计发放额__5年以内含___AND_0302010102("0302","0302010102","历史累计发放额（5年以内含）"," ","14","01","bm_khjg","机构","bm_yhbm","银行名称"," "," ","1","01",true),
    S_185_SEQ_历史累计发放额__5年以上___AND_0302010103("0302","0302010103","历史累计发放额（5年以上）"," ","14","01","bm_khjg","机构","bm_yhbm","银行名称"," "," ","1","01",true),



    S_186_SEQ_历史累计回收额_AND_0302010201("0302","0302010201","历史累计回收额"," ","15","01","bm_khjg","机构","bm_yhbm","银行名称"," "," ","1","01",true),
    S_187_SEQ_历史累计回收额__正常___AND_0302010202("0302","0302010202","历史累计回收额（正常）"," ","15","01","bm_khjg","机构","bm_yhbm","银行名称"," "," ","1","01",true),
    S_188_SEQ_历史累计回收额__逾期___AND_0302010203("0302","0302010203","历史累计回收额（逾期）"," ","15","01","bm_khjg","机构","bm_yhbm","银行名称"," "," ","1","01",true),
    S_189_SEQ_历史累计回收额__提前还本___AND_0302010204("0302","0302010204","历史累计回收额（提前还本）"," ","15","01","bm_khjg","机构","bm_yhbm","银行名称"," "," ","1","01",true),
    S_190_SEQ_历史累计回收额__正常还清___AND_0302010205("0302","0302010205","历史累计回收额（正常还清）"," ","15","01","bm_khjg","机构","bm_yhbm","银行名称"," "," ","1","01",true),
    S_191_SEQ_历史累计回收额__提前还清___AND_0302010206("0302","0302010206","历史累计回收额（提前还清）"," ","15","01","bm_khjg","机构","bm_yhbm","银行名称"," "," ","1","01",true),
    S_192_SEQ_历史累计回收额__本行回收___AND_0302010207("0302","0302010207","历史累计回收额（本行回收）"," ","15","01","bm_khjg","机构","bm_yhbm","银行名称"," "," ","1","01",true),
    S_193_SEQ_历史累计回收额__他行回收___AND_0302010208("0302","0302010208","历史累计回收额（他行回收）"," ","15","01","bm_khjg","机构","bm_yhbm","银行名称"," "," ","1","01",true),
    S_194_SEQ_历史累计回收额__5年以内含___AND_0302010210("0302","0302010210","历史累计回收额（5年以内含）"," ","15","01","bm_khjg","机构","bm_yhbm","银行名称"," "," ","1","01",true),
    S_195_SEQ_历史累计回收额__5年以上___AND_0302010211("0302","0302010211","历史累计回收额（5年以上）"," ","15","01","bm_khjg","机构","bm_yhbm","银行名称"," "," ","1","01",true),
    S_196_SEQ_历史累计回收额__现金___AND_0302010212("0302","0302010212","历史累计回收额（现金）"," ","15","01","bm_khjg","机构","bm_yhbm","银行名称"," "," ","1"," ",true),
    S_197_SEQ_历史累计回收额__冲还贷___AND_0302010213("0302","0302010213","历史累计回收额（冲还贷）"," ","15","01","bm_khjg","机构","bm_yhbm","银行名称"," "," ","1"," ",true),






    S_198_SEQ_历史累计结清额_AND_0302010301("0302","0302010301","历史累计结清额"," ","16","01","bm_khjg","机构","bm_yhbm","银行名称"," "," ","1","01",true),
    S_199_SEQ_历史累计结清额__正常___AND_0302010302("0302","0302010302","历史累计结清额（正常）"," ","16","01","bm_khjg","机构","bm_yhbm","银行名称"," "," ","1","01",true),
    S_200_SEQ_历史累计结清额__提前___AND_0302010303("0302","0302010303","历史累计结清额（提前）"," ","16","01","bm_khjg","机构","bm_yhbm","银行名称"," "," ","1","01",true),
    S_201_SEQ_历史累计结清额__逾期___AND_0302010304("0302","0302010304","历史累计结清额（逾期）"," ","16","01","bm_khjg","机构","bm_yhbm","银行名称"," "," ","1","01",true),








    S_202_SEQ_历史累计回收利息_AND_0302010401("0302","0302010401","历史累计回收利息"," ","17","01","bm_khjg","机构","bm_yhbm","银行名称"," "," ","1","01",true),
    S_203_SEQ_历史累计回收利息__正常___AND_0302010402("0302","0302010402","历史累计回收利息（正常）"," ","17","01","bm_khjg","机构","bm_yhbm","银行名称"," "," ","1","01",true),
    S_204_SEQ_历史累计回收利息__逾期___AND_0302010403("0302","0302010403","历史累计回收利息（逾期）"," ","17","01","bm_khjg","机构","bm_yhbm","银行名称"," "," ","1","01",true),
    S_205_SEQ_历史累计回收利息__提前还本___AND_0302010404("0302","0302010404","历史累计回收利息（提前还本）"," ","17","01","bm_khjg","机构","bm_yhbm","银行名称"," "," ","1","01",true),
    S_206_SEQ_历史累计回收利息__正常还清___AND_0302010405("0302","0302010405","历史累计回收利息（正常还清）"," ","17","01","bm_khjg","机构","bm_yhbm","银行名称"," "," ","1","01",true),
    S_207_SEQ_历史累计回收利息__提前还清___AND_0302010406("0302","0302010406","历史累计回收利息（提前还清）"," ","17","01","bm_khjg","机构","bm_yhbm","银行名称"," "," ","1","01",true),
    S_208_SEQ_历史累计回收利息__本行回收___AND_0302010407("0302","0302010407","历史累计回收利息（本行回收）"," ","17","01","bm_khjg","机构","bm_yhbm","银行名称"," "," ","1","01",true),
    S_209_SEQ_历史累计回收利息__他行回收___AND_0302010408("0302","0302010408","历史累计回收利息（他行回收）"," ","17","01","bm_khjg","机构","bm_yhbm","银行名称"," "," ","1","01",true),
    S_210_SEQ_历史累计回收利息__5年以下含___AND_0302010410("0302","0302010410","历史累计回收利息（5年以下含）"," ","17","01","bm_khjg","机构","bm_yhbm","银行名称"," "," ","1","01",true),
    S_211_SEQ_历史累计回收利息__5年以上___AND_0302010411("0302","0302010411","历史累计回收利息（5年以上）"," ","17","01","bm_khjg","机构","bm_yhbm","银行名称"," "," ","1","01",true),


    S_212_SEQ_历史累计逾期本息_AND_0302010701("0302","0302010701","历史累计逾期本息"," ","18","01","bm_khjg","机构","bm_yhbm","银行名称"," "," ","1","01",true),
    S_213_SEQ_历史累计逾期本金_AND_0302010702("0302","0302010702","历史累计逾期本金"," ","18","01","bm_khjg","机构","bm_yhbm","银行名称"," "," ","1","01",true),
    S_214_SEQ_历史累计逾期利息_AND_0302010703("0302","0302010703","历史累计逾期利息"," ","18","01","bm_khjg","机构","bm_yhbm","银行名称"," "," ","1","01",true),


    S_215_SEQ_历史累计发放户数_AND_0302012001("0302","0302012001","历史累计发放户数"," ","14","01","bm_khjg","机构","bm_yhbm","银行名称"," "," ","0","03",true),
    S_216_SEQ_历史累计发放户数__5年以内含___AND_0302012002("0302","0302012002","历史累计发放户数（5年以内含）"," ","14","01","bm_khjg","机构","bm_yhbm","银行名称"," "," ","0","03",true),
    S_217_SEQ_历史累计发放户数__5年以上___AND_0302012003("0302","0302012003","历史累计发放户数（5年以上）"," ","14","01","bm_khjg","机构","bm_yhbm","银行名称"," "," ","0","03",true),


    S_218_SEQ_存量贷款笔数_AND_0302012004("0302","0302012004","存量贷款笔数"," ","07","03","bm_khjg","机构","bm_yhbm","银行名称"," "," ","0","04",true),
    S_219_SEQ_存量贷款笔数__缴存状态___AND_0302012009("0302","0302012009","存量贷款笔数(缴存状态)"," ","07","03","bm_khjg","机构","bm_gz_grzhzt","缴存状态"," "," ","0"," ",true),


    S_220_SEQ_历史累计回收户数_AND_0302012101("0302","0302012101","历史累计回收户数"," ","15","03","bm_khjg","机构","bm_yhbm","银行名称"," "," ","0","03",true),
    S_221_SEQ_历史累计回收户数__正常___AND_0302012102("0302","0302012102","历史累计回收户数（正常）"," ","15","03","bm_khjg","机构","bm_yhbm","银行名称"," "," ","0","03",true),
    S_222_SEQ_历史累计回收户数__逾期___AND_0302012103("0302","0302012103","历史累计回收户数（逾期）"," ","15","03","bm_khjg","机构","bm_yhbm","银行名称"," "," ","0","03",true),
    S_223_SEQ_历史累计回收户数__提前还本___AND_0302012104("0302","0302012104","历史累计回收户数（提前还本）"," ","15","03","bm_khjg","机构","bm_yhbm","银行名称"," "," ","0","03",true),
    S_224_SEQ_历史累计回收户数__正常还清___AND_0302012105("0302","0302012105","历史累计回收户数（正常还清）"," ","15","03","bm_khjg","机构","bm_yhbm","银行名称"," "," ","0","03",true),
    S_225_SEQ_历史累计回收户数__提前还清___AND_0302012106("0302","0302012106","历史累计回收户数（提前还清）"," ","15","03","bm_khjg","机构","bm_yhbm","银行名称"," "," ","0","03",true),
    S_226_SEQ_历史累计回收户数__本行回收___AND_0302012107("0302","0302012107","历史累计回收户数（本行回收）"," ","15","03","bm_khjg","机构","bm_yhbm","银行名称"," "," ","0","03",true),
    S_227_SEQ_历史累计回收户数__他行回收___AND_0302012108("0302","0302012108","历史累计回收户数（他行回收）"," ","15","03","bm_khjg","机构","bm_yhbm","银行名称"," "," ","0","03",true),
    S_228_SEQ_历史累计结清户数_AND_0302012201("0302","0302012201","历史累计结清户数"," ","16","03","bm_khjg","机构","bm_yhbm","银行名称"," "," ","0","03",true),



    S_229_SEQ_历史累计结清户数__正常___AND_0302012202("0302","0302012202","历史累计结清户数（正常）"," ","16","03","bm_khjg","机构","bm_yhbm","银行名称"," "," ","0","03",true),
    S_230_SEQ_历史累计结清户数__提前___AND_0302012203("0302","0302012203","历史累计结清户数（提前）"," ","16","03","bm_khjg","机构","bm_yhbm","银行名称"," "," ","0","03",true),
    S_231_SEQ_历史累计结清户数__逾期___AND_0302012204("0302","0302012204","历史累计结清户数（逾期）"," ","16","03","bm_khjg","机构","bm_yhbm","银行名称"," "," ","0","03",true),




    S_232_SEQ_贷款发放占缴存额比重__月___AND_0302020101("0302","0302020101","贷款发放占缴存额比重（月）"," ","19","03"," "," "," "," "," "," ","1"," ",true),
    S_233_SEQ_住房公积金运用率__月___AND_0302020201("0302","0302020201","住房公积金运用率（月）"," ","19","03"," "," "," "," "," "," ","1"," ",true),
    S_234_SEQ_住房公积金个贷率__月___AND_0302020301("0302","0302020301","住房公积金个贷率（月）"," ","19","03"," "," "," "," "," "," ","1"," ",true),
    S_235_SEQ_住房公积金个贷逾期率__月___AND_0302020401("0302","0302020401","住房公积金个贷逾期率（月）"," ","19","03"," "," "," "," "," "," ","1"," ",true),
    S_236_SEQ_住房公积金个贷增长率__月___AND_0302020501("0302","0302020501","住房公积金个贷增长率__月）"," ","19","03"," "," "," "," "," "," ","1"," ",true),





    S_237_SEQ_发放人数__购房面积___AND_0302030001("0302","0302030001","发放人数(购房面积)","发放人数(购房面积)","20","06","bm_khjg","机构","bm_bi_gfmj","购房面积"," "," ","0","02",true),


    S_238_SEQ_贷款职工人数__收入水平___AND_0302040001("0302","0302040001","贷款职工人数(收入水平)","贷款职工人数(收入水平包含低收入、中收入、高收入)","25","06","bm_khjg","机构","bm_bi_srsp","收入水平"," "," ","0","02",true),
    S_239_SEQ_贷款职工人数__新房__二手房___AND_0302040002("0302","0302040002","贷款职工人数(新房、二手房)","贷款职工人数(新房、二手房)","26","06","bm_khjg","机构","bm_bi_fwxz","房屋性质"," "," ","0","02",true),


    S_240_SEQ_共同借款人人数_AND_0302040003("0302","0302040003","共同借款人人数"," ","17","03","bm_khjg","机构"," "," "," "," ","0","02",true),
    S_241_SEQ_贷款购房建筑面积_AND_0302040004("0302","0302040004","贷款购房建筑面积"," ","17","03","bm_khjg","机构"," "," "," "," ","1","05",true),
    S_242_SEQ_贷款购房建筑总价_AND_0302040005("0302","0302040005","贷款购房建筑总价"," ","17","03","bm_khjg","机构"," "," "," "," ","1","01",true),;

    private final String 业务代码;
    private final String 指标编码;
    private final String 指标名称;
    private final String 指标说明;
    private final String 指标分类;

    private final String 统计周期;

    private final String 维度一;
    private final String 维度一描述;
    private final String 维度二;
    private final String 维度二描述;
    private final String 维度三;
    private final String 维度三描述;
    private final String 显示精度;
    private final String 项目单位;
    private final Boolean 是否完成;


    public Boolean get是否完成() {
        return 是否完成;
    }

    public String get业务代码() {
        return 业务代码;
    }

    public String get指标编码() {
        return 指标编码;
    }

    public String get指标名称() {
        return 指标名称;
    }

    public String get指标说明() {
        return 指标说明;
    }

    public String get指标分类() {
        return 指标分类;
    }

    public String get统计周期() {
        return 统计周期;
    }

    public String get维度一() {
        return 维度一;
    }

    public String get维度一描述() {
        return 维度一描述;
    }

    public String get维度二() {
        return 维度二;
    }

    public String get维度二描述() {
        return 维度二描述;
    }

    public String get维度三() {
        return 维度三;
    }

    public String get维度三描述() {
        return 维度三描述;
    }

    public String get显示精度() {
        return 显示精度;
    }

    public String get项目单位() {
        return 项目单位;
    }

    StatisticalIndexCodeEnum(String 业务代码,
                             String 指标编码,
                             String 指标名称,
                             String 指标说明,
                             String 指标分类,
                             String 统计周期,
                             String 维度一,
                             String 维度一描述,
                             String 维度二,
                             String 维度二描述,
                             String 维度三,
                             String 维度三描述,
                             String 显示精度,
                             String 项目单位,
                             Boolean 是否完成) {
        this.业务代码 = 业务代码;
        this.指标编码 = 指标编码;
        this.指标名称 = 指标名称;
        this.指标说明 = 指标说明;
        this.指标分类 = 指标分类;

        this.统计周期 = 统计周期;

        this.维度一 = 维度一;
        this.维度一描述 = 维度一描述;
        this.维度二 = 维度二;
        this.维度二描述 = 维度二描述;
        this.维度三 = 维度三;
        this.维度三描述 = 维度三描述;
        this.显示精度 = 显示精度;
        this.项目单位 = 项目单位;
        this.是否完成 = 是否完成;
    }


    public static List<Map> retriveTypeseMap() {
        // String userUrl =  linkTo(methodOn(MobileDistributorController.class).detail(null)).withSelfRel().getHref();

        List<Map> list = new ArrayList<Map>();
        for (StatisticalIndexCodeEnum status : StatisticalIndexCodeEnum.values()) {

            Map map= new HashMap();
            ListItem<String> element = new ListItem<String>(status.get业务代码(), status.get指标名称(), status.get指标编码(), status.get是否完成());
            map.put("业务代码",status.get业务代码());
            map.put("指标名称",status.get指标名称());
            map.put("指标编码",status.get指标编码());
            map.put("是否完成",status.get是否完成());

            list.add(map);
        }

        return list;

    }
    public static List<ListItem> retriveTypese() {
       // String userUrl =  linkTo(methodOn(MobileDistributorController.class).detail(null)).withSelfRel().getHref();

        List<ListItem> list = new ArrayList<ListItem>();
        for (StatisticalIndexCodeEnum status : StatisticalIndexCodeEnum.values()) {
            ListItem<String> element = new ListItem<String>(status.get业务代码(), status.get指标名称(), status.get指标编码(), status.get是否完成());
            list.add(element);
        }

        return list;

    }
/*
    public static List<ListItem> retriveTypese() {

        List<ListItem> list = new ArrayList<ListItem>();
        for (AccountingVoucherStatusEnum status : AccountingVoucherStatusEnum.values()) {
            ListItem element = new ListItem(status.getId(,false), status.getDisplayText(,false), status.getHelpMessage());
            list.add(element);
        }

        return list;

    }


    public static List<ListItem> retriveTypese(String statusText) {

        List<ListItem> list = new ArrayList<ListItem>();
        for(PersonalAccountStatusEnum status : PersonalAccountStatusEnum.values()) {
            ListItem element = new ListItem(status.getText(,false), status.getDisplayText());
            if (status.getText().equals(statusText)){
                element.setSelected(true);
            }
            list.add(element);
        }
        return list;

    }*/



    public static StatisticalIndexCodeEnum fromString指标编码(String text) {
        for (StatisticalIndexCodeEnum status : StatisticalIndexCodeEnum.values()) {
            if (status.get指标编码().equals(text) ) {
                return status;
            }
        }
        throw new RuntimeException("no customer status " + text);
    }
/*
    public static StatisticalIndexCodeEnum fromInt(Integer text) {
        for (StatisticalIndexCodeEnum status : StatisticalIndexCodeEnum.values()) {
            if (status.getId().equals(text) ) {
                return status;
            }
        }
        throw new RuntimeException("no customer status " + text);
    }*/

}
