package org.ylgjj.loan.outputenum;

//import com.coalvalue.domain.pojo.ListItem;

/**
 * Created by silence on 2016/1/18.
 */
public enum 统计指标编码 {

    H__1__暂存款笔数__0301__0301000101__指标说明__TT__指标分类__01__统计周期__03__bm_khjg__机构__bm_dwjjlx__经济类型__维度三__TT__TT__显示精度__0__项目单位__04("0301","0301000101","暂存款笔数"," ","01","03","bm_khjg","机构","bm_dwjjlx","经济类型"," "," ","0","04"),
    H__2__实缴单位数__0301__0301000201__指标说明__TT__指标分类__01__统计周期__03__bm_khjg__机构__bm_dwjjlx__经济类型__维度三__TT__TT__显示精度__0__项目单位__02("0301","0301000201","实缴单位数"," ","01","03","bm_khjg","机构","bm_dwjjlx","经济类型"," "," ","0","02"),
    H__3__实缴单位数__按年____0301__0301000202__指标说明__TT__指标分类__01__统计周期__06__bm_khjg__机构__bm_dwjjlx__经济类型__维度三__TT__TT__显示精度__0__项目单位__TT("0301","0301000202","实缴单位数(按年)"," ","01","06","bm_khjg","机构","bm_dwjjlx","经济类型"," "," ","0"," "),
    H__4__未缴单位数__0301__0301000301__指标说明__TT__指标分类__01__统计周期__03__bm_khjg__机构__bm_dwjjlx__经济类型__维度三__TT__TT__显示精度__0__项目单位__02("0301","0301000301","未缴单位数"," ","01","03","bm_khjg","机构","bm_dwjjlx","经济类型"," "," ","0","02"),
    H__5__实存单位数__0301__0301000401__指标说明__TT__指标分类__01__统计周期__01__bm_khjg__机构__bm_dwjjlx__经济类型__维度三__TT__TT__显示精度__0__项目单位__02("0301","0301000401","实存单位数"," ","01","01","bm_khjg","机构","bm_dwjjlx","经济类型"," "," ","0","02"),
    H__6__新增单位数__0301__0301000501__指标说明__TT__指标分类__01__统计周期__01__bm_khjg__机构__bm_dwjjlx__经济类型__维度三__TT__TT__显示精度__0__项目单位__02("0301","0301000501","新增单位数"," ","01","01","bm_khjg","机构","bm_dwjjlx","经济类型"," "," ","0","02"),
    H__7__销户单位数__0301__0301000601__指标说明__TT__指标分类__01__统计周期__01__bm_khjg__机构__bm_dwjjlx__经济类型__维度三__TT__TT__显示精度__0__项目单位__02("0301","0301000601","销户单位数"," ","01","01","bm_khjg","机构","bm_dwjjlx","经济类型"," "," ","0","02"),
    H__8__封存单位数__0301__0301000701__指标说明__TT__指标分类__01__统计周期__01__bm_khjg__机构__bm_dwjjlx__经济类型__维度三__TT__TT__显示精度__0__项目单位__02("0301","0301000701","封存单位数"," ","01","01","bm_khjg","机构","bm_dwjjlx","经济类型"," "," ","0","02"),
    H__9__缓缴单位数__0301__0301000801__指标说明__TT__指标分类__01__统计周期__01__bm_khjg__机构__bm_dwjjlx__经济类型__维度三__TT__TT__显示精度__0__项目单位__02("0301","0301000801","缓缴单位数"," ","01","01","bm_khjg","机构","bm_dwjjlx","经济类型"," "," ","0","02"),
    H__10__比例超限单位数__0301__0301000901__指标说明__TT__指标分类__01__统计周期__01__bm_khjg__机构__bm_dwjjlx__经济类型__维度三__TT__TT__显示精度__0__项目单位__02("0301","0301000901","比例超限单位数"," ","01","01","bm_khjg","机构","bm_dwjjlx","经济类型"," "," ","0","02"),
    H__11__缴暂存款净额__0301__0301001001__指标说明__TT__指标分类__03__统计周期__03__bm_khjg__机构__bm_dwjjlx__经济类型__维度三__TT__TT__显示精度__1__项目单位__TT("0301","0301001001","缴暂存款净额"," ","03","03","bm_khjg","机构","bm_dwjjlx","经济类型"," "," ","1"," "),
    H__12__补缴单位数__0301__0301001101__指标说明__TT__指标分类__01__统计周期__03__bm_khjg__机构__bm_dwjjlx__经济类型__维度三__TT__TT__显示精度__0__项目单位__02("0301","0301001101","补缴单位数"," ","01","03","bm_khjg","机构","bm_dwjjlx","经济类型"," "," ","0","02"),
    H__13__开户总单位数__0301__0301002101__指标说明__TT__指标分类__01__统计周期__01__bm_khjg__机构__bm_dwjjlx__经济类型__维度三__TT__TT__显示精度__0__项目单位__02("0301","0301002101","开户总单位数"," ","01","01","bm_khjg","机构","bm_dwjjlx","经济类型"," "," ","0","02"),
    H__14__销户总单位数__0301__0301002201__指标说明__TT__指标分类__01__统计周期__01__bm_khjg__机构__bm_dwjjlx__经济类型__维度三__TT__TT__显示精度__0__项目单位__02("0301","0301002201","销户总单位数"," ","01","01","bm_khjg","机构","bm_dwjjlx","经济类型"," "," ","0","02"),
    H__15__正常总单位数__0301__0301002301__指标说明__TT__指标分类__01__统计周期__01__bm_khjg__机构__bm_dwjjlx__经济类型__维度三__TT__TT__显示精度__0__项目单位__02("0301","0301002301","正常总单位数"," ","01","01","bm_khjg","机构","bm_dwjjlx","经济类型"," "," ","0","02"),
    H__16__封存总单位数__0301__0301002401__指标说明__TT__指标分类__01__统计周期__01__bm_khjg__机构__bm_dwjjlx__经济类型__维度三__TT__TT__显示精度__0__项目单位__02("0301","0301002401","封存总单位数"," ","01","01","bm_khjg","机构","bm_dwjjlx","经济类型"," "," ","0","02"),
    H__17__应缴人数__0301__0301003101__指标说明__TT__指标分类__02__统计周期__03__bm_khjg__机构__bm_dwjjlx__经济类型__维度三__TT__TT__显示精度__0__项目单位__02("0301","0301003101","应缴人数"," ","02","03","bm_khjg","机构","bm_dwjjlx","经济类型"," "," ","0","02"),
    H__18__实缴人数__0301__0301003201__指标说明__TT__指标分类__02__统计周期__03__bm_khjg__机构__bm_dwjjlx__经济类型__维度三__TT__TT__显示精度__0__项目单位__02("0301","0301003201","实缴人数"," ","02","03","bm_khjg","机构","bm_dwjjlx","经济类型"," "," ","0","02"),
    H__19__提取人数__非本市缴存职工____0301__0301003203__指标说明__TT__指标分类__02__统计周期__06__bm_khjg__机构__bm_bi_khnx__开户年限__维度三__TT__TT__显示精度__0__项目单位__TT("0301","0301003203","提取人数（非本市缴存职工）"," ","02","06","bm_khjg","机构","bm_bi_khnx","开户年限"," "," ","0"," "),
    H__20__提取金额__收入水平____0301__0301003204__指标说明__提取金额__收入水平包含低收入___中收入___高收入____指标分类__25__统计周期__01__bm_khjg__机构__bm_bi_srsp__收入水平__维度三__TT__TT__显示精度__1__项目单位__TT("0301","0301003204","提取金额(收入水平)","提取金额(收入水平包含低收入___中收入___高收入)","25","01","bm_khjg","机构","bm_bi_srsp","收入水平"," "," ","1"," "),
    H__21__新开户职工数__非本市缴存职工____0301__0301003205__指标说明__TT__指标分类__02__统计周期__06__bm_khjg__机构__bm_bi_khnx__开户年限__维度三__TT__TT__显示精度__0__项目单位__TT("0301","0301003205","新开户职工数（非本市缴存职工）"," ","02","06","bm_khjg","机构","bm_bi_khnx","开户年限"," "," ","0"," "),
    H__22__实缴人数__按年____0301__0301003206__指标说明__TT__指标分类__02__统计周期__06__bm_khjg__机构__bm_dwjjlx__经济类型__维度三__TT__TT__显示精度__0__项目单位__TT("0301","0301003206","实缴人数(按年)"," ","02","06","bm_khjg","机构","bm_dwjjlx","经济类型"," "," ","0"," "),
    H__23__提取金额__非本市缴存职工____0301__0301003207__指标说明__TT__指标分类__04__统计周期__01__bm_khjg__机构__TT__TT__维度三__TT__TT__显示精度__1__项目单位__TT("0301","0301003207","提取金额（非本市缴存职工）"," ","04","01","bm_khjg","机构"," "," "," "," ","1"," "),
    H__24__提取人次__收入水平____0301__0301003208__指标说明__提取人次__收入水平包含低收入___中收入___高收入____指标分类__25__统计周期__03__bm_khjg__机构__bm_bi_srsp__收入水平__维度三__TT__TT__显示精度__0__项目单位__TT("0301","0301003208","提取人次(收入水平)","提取人次(收入水平包含低收入___中收入___高收入)","25","03","bm_khjg","机构","bm_bi_srsp","收入水平"," "," ","0"," "),
    H__25__实缴人数__个人缴存基数____0301__0301003209__指标说明__TT__指标分类__02__统计周期__03__bm_khjg__机构__bm_dwjjlx__经济类型__维度三__TT__TT__显示精度__0__项目单位__TT("0301","0301003209","实缴人数(个人缴存基数)"," ","02","03","bm_khjg","机构","bm_dwjjlx","经济类型"," "," ","0"," "),
    H__26__实缴人数__月缴存额____0301__0301003210__指标说明__TT__指标分类__02__统计周期__03__bm_khjg__机构__bm_dwjjlx__经济类型__维度三__TT__TT__显示精度__0__项目单位__TT("0301","0301003210","实缴人数(月缴存额)"," ","02","03","bm_khjg","机构","bm_dwjjlx","经济类型"," "," ","0"," "),
    H__27__缴存金额__非本市缴存职工____0301__0301003211__指标说明__TT__指标分类__03__统计周期__06__bm_khjg__机构__bm_bi_khnx__开户年限__维度三__TT__TT__显示精度__1__项目单位__TT("0301","0301003211","缴存金额（非本市缴存职工）"," ","03","06","bm_khjg","机构","bm_bi_khnx","开户年限"," "," ","1"," "),
    H__28__实缴人次__0301__0301003301__指标说明__TT__指标分类__02__统计周期__03__bm_khjg__机构__bm_dwjjlx__经济类型__维度三__TT__TT__显示精度__0__项目单位__02("0301","0301003301","实缴人次"," ","02","03","bm_khjg","机构","bm_dwjjlx","经济类型"," "," ","0","02"),
    H__29__补缴人数__0301__0301003401__指标说明__TT__指标分类__02__统计周期__03__bm_khjg__机构__bm_dwjjlx__经济类型__维度三__TT__TT__显示精度__0__项目单位__02("0301","0301003401","补缴人数"," ","02","03","bm_khjg","机构","bm_dwjjlx","经济类型"," "," ","0","02"),
    H__30__未缴人数__0301__0301003501__指标说明__TT__指标分类__02__统计周期__03__bm_khjg__机构__bm_dwjjlx__经济类型__维度三__TT__TT__显示精度__0__项目单位__02("0301","0301003501","未缴人数"," ","02","03","bm_khjg","机构","bm_dwjjlx","经济类型"," "," ","0","02"),
    H__31__新增人数__0301__0301003601__指标说明__TT__指标分类__02__统计周期__01__bm_khjg__机构__bm_dwjjlx__经济类型__维度三__TT__TT__显示精度__0__项目单位__02("0301","0301003601","新增人数"," ","02","01","bm_khjg","机构","bm_dwjjlx","经济类型"," "," ","0","02"),
    H__32__新增人数__非本市缴存职工____0301__0301003602__指标说明__TT__指标分类__02__统计周期__01__bm_khjg__机构__TT__TT__维度三__TT__TT__显示精度__0__项目单位__TT("0301","0301003602","新增人数（非本市缴存职工）"," ","02","01","bm_khjg","机构"," "," "," "," ","0"," "),
    H__33__封存人数__0301__0301003701__指标说明__TT__指标分类__02__统计周期__03__bm_khjg__机构__bm_dwjjlx__经济类型__维度三__TT__TT__显示精度__0__项目单位__02("0301","0301003701","封存人数"," ","02","03","bm_khjg","机构","bm_dwjjlx","经济类型"," "," ","0","02"),
    H__34__销户人数__0301__0301003801__指标说明__TT__指标分类__02__统计周期__03__bm_khjg__机构__bm_dwjjlx__经济类型__维度三__TT__TT__显示精度__0__项目单位__02("0301","0301003801","销户人数"," ","02","03","bm_khjg","机构","bm_dwjjlx","经济类型"," "," ","0","02"),
    H__35__历史累计销户人数__0301__0301003802__指标说明__TT__指标分类__05__统计周期__03__bm_khjg__机构__bm_dwjjlx__经济类型__维度三__TT__TT__显示精度__0__项目单位__02("0301","0301003802","历史累计销户人数"," ","05","03","bm_khjg","机构","bm_dwjjlx","经济类型"," "," ","0","02"),
    H__36__提取人数__0301__0301003901__指标说明__TT__指标分类__02__统计周期__03__bm_khjg__机构__bm_dwjjlx__经济类型__维度三__TT__TT__显示精度__0__项目单位__02("0301","0301003901","提取人数"," ","02","03","bm_khjg","机构","bm_dwjjlx","经济类型"," "," ","0","02"),
    H__37__提取人数__提取原因____0301__0301003911__指标说明__TT__指标分类__02__统计周期__03__bm_khjg__机构__bm_gz_tqyy__提取原因__维度三__TT__TT__显示精度__0__项目单位__02("0301","0301003911","提取人数(提取原因)"," ","02","03","bm_khjg","机构","bm_gz_tqyy","提取原因"," "," ","0","02"),
    H__38__提取人次__0301__0301004001__指标说明__TT__指标分类__02__统计周期__03__bm_khjg__机构__bm_dwjjlx__经济类型__维度三__TT__TT__显示精度__0__项目单位__02("0301","0301004001","提取人次"," ","02","03","bm_khjg","机构","bm_dwjjlx","经济类型"," "," ","0","02"),
    H__39__提取人次__提取原因____0301__0301004011__指标说明__TT__指标分类__02__统计周期__03__bm_khjg__机构__bm_gz_tqyy__提取原因__维度三__TT__TT__显示精度__0__项目单位__02("0301","0301004011","提取人次(提取原因)"," ","02","03","bm_khjg","机构","bm_gz_tqyy","提取原因"," "," ","0","02"),
    H__40__外部转入人数__0301__0301004101__指标说明__TT__指标分类__02__统计周期__03__bm_khjg__机构__bm_dwjjlx__经济类型__维度三__TT__TT__显示精度__0__项目单位__02("0301","0301004101","外部转入人数"," ","02","03","bm_khjg","机构","bm_dwjjlx","经济类型"," "," ","0","02"),
    H__41__外部转出人数__0301__0301004201__指标说明__TT__指标分类__02__统计周期__03__bm_khjg__机构__bm_dwjjlx__经济类型__维度三__TT__TT__显示精度__0__项目单位__02("0301","0301004201","外部转出人数"," ","02","03","bm_khjg","机构","bm_dwjjlx","经济类型"," "," ","0","02"),
    H__42__实存人数__0301__0301005101__指标说明__TT__指标分类__02__统计周期__01__bm_khjg__机构__bm_dwjjlx__经济类型__维度三__TT__TT__显示精度__0__项目单位__02("0301","0301005101","实存人数"," ","02","01","bm_khjg","机构","bm_dwjjlx","经济类型"," "," ","0","02"),
    H__43__开户总人数__0301__0301005201__指标说明__TT__指标分类__02__统计周期__01__bm_khjg__机构__bm_dwjjlx__经济类型__维度三__TT__TT__显示精度__0__项目单位__02("0301","0301005201","开户总人数"," ","02","01","bm_khjg","机构","bm_dwjjlx","经济类型"," "," ","0","02"),
    H__44__正常总人数__0301__0301005301__指标说明__TT__指标分类__02__统计周期__01__bm_khjg__机构__bm_dwjjlx__经济类型__维度三__TT__TT__显示精度__0__项目单位__02("0301","0301005301","正常总人数"," ","02","01","bm_khjg","机构","bm_dwjjlx","经济类型"," "," ","0","02"),
    H__45__封存总人数__0301__0301005401__指标说明__TT__指标分类__02__统计周期__01__bm_khjg__机构__bm_dwjjlx__经济类型__维度三__TT__TT__显示精度__0__项目单位__02("0301","0301005401","封存总人数"," ","02","01","bm_khjg","机构","bm_dwjjlx","经济类型"," "," ","0","02"),
    H__46__销户总人数__0301__0301005501__指标说明__TT__指标分类__02__统计周期__01__bm_khjg__机构__bm_dwjjlx__经济类型__维度三__TT__TT__显示精度__0__项目单位__02("0301","0301005501","销户总人数"," ","02","01","bm_khjg","机构","bm_dwjjlx","经济类型"," "," ","0","02"),
    H__47__冻结总人数__0301__0301005601__指标说明__TT__指标分类__02__统计周期__01__bm_khjg__机构__bm_dwjjlx__经济类型__维度三__TT__TT__显示精度__0__项目单位__02("0301","0301005601","冻结总人数"," ","02","01","bm_khjg","机构","bm_dwjjlx","经济类型"," "," ","0","02"),
    H__48__应归集额__0301__0301007101__指标说明__TT__指标分类__03__统计周期__03__bm_khjg__机构__bm_dwjjlx__经济类型__维度三__TT__TT__显示精度__1__项目单位__01("0301","0301007101","应归集额"," ","03","03","bm_khjg","机构","bm_dwjjlx","经济类型"," "," ","1","01"),
    H__49__实归集额__0301__0301007201__指标说明__TT__指标分类__03__统计周期__01__bm_khjg__机构__bm_dwjjlx__经济类型__维度三__TT__TT__显示精度__1__项目单位__01("0301","0301007201","实归集额"," ","03","01","bm_khjg","机构","bm_dwjjlx","经济类型"," "," ","1","01"),
    H__50__实归集额__缴存基数____0301__0301007202__指标说明__TT__指标分类__03__统计周期__01__bm_khjg__机构__bm_dwjjlx__经济类型__维度三__TT__TT__显示精度__1__项目单位__TT("0301","0301007202","实归集额(缴存基数)"," ","03","01","bm_khjg","机构","bm_dwjjlx","经济类型"," "," ","1"," "),
    H__51__实归集额__月缴存额____0301__0301007203__指标说明__TT__指标分类__03__统计周期__01__bm_khjg__机构__bm_dwjjlx__经济类型__维度三__TT__TT__显示精度__1__项目单位__TT("0301","0301007203","实归集额(月缴存额)"," ","03","01","bm_khjg","机构","bm_dwjjlx","经济类型"," "," ","1"," "),
    H__52__补缴金额__0301__0301007301__指标说明__TT__指标分类__03__统计周期__03__bm_khjg__机构__bm_dwjjlx__经济类型__维度三__TT__TT__显示精度__1__项目单位__01("0301","0301007301","补缴金额"," ","03","03","bm_khjg","机构","bm_dwjjlx","经济类型"," "," ","1","01"),
    H__53__提取本金__0301__0301007601__指标说明__TT__指标分类__04__统计周期__01__bm_khjg__机构__bm_dwjjlx__经济类型__维度三__TT__TT__显示精度__1__项目单位__01("0301","0301007601","提取本金"," ","04","01","bm_khjg","机构","bm_dwjjlx","经济类型"," "," ","1","01"),
    H__54__提取本金__跨中心转出____0301__0301007602__指标说明__TT__指标分类__04__统计周期__01__bm_khjg__机构__bm_dwjjlx__经济类型__维度三__TT__TT__显示精度__1__项目单位__TT("0301","0301007602","提取本金(跨中心转出)"," ","04","01","bm_khjg","机构","bm_dwjjlx","经济类型"," "," ","1"," "),
    H__55__提取本金__提取原因____0301__0301007611__指标说明__TT__指标分类__04__统计周期__01__bm_khjg__机构__bm_gz_tqyy__提取原因__维度三__TT__TT__显示精度__1__项目单位__01("0301","0301007611","提取本金(提取原因)"," ","04","01","bm_khjg","机构","bm_gz_tqyy","提取原因"," "," ","1","01"),
    H__56__提取利息__0301__0301007701__指标说明__TT__指标分类__04__统计周期__01__bm_khjg__机构__bm_dwjjlx__经济类型__维度三__TT__TT__显示精度__1__项目单位__01("0301","0301007701","提取利息"," ","04","01","bm_khjg","机构","bm_dwjjlx","经济类型"," "," ","1","01"),
    H__57__提取利息__提取原因____0301__0301007711__指标说明__TT__指标分类__04__统计周期__01__bm_khjg__机构__bm_gz_tqyy__提取原因__维度三__TT__TT__显示精度__1__项目单位__01("0301","0301007711","提取利息(提取原因)"," ","04","01","bm_khjg","机构","bm_gz_tqyy","提取原因"," "," ","1","01"),
    H__58__外部转入金额__0301__0301007801__指标说明__TT__指标分类__03__统计周期__01__bm_khjg__机构__bm_dwjjlx__经济类型__维度三__TT__TT__显示精度__1__项目单位__01("0301","0301007801","外部转入金额"," ","03","01","bm_khjg","机构","bm_dwjjlx","经济类型"," "," ","1","01"),
    H__59__外部转出金额__本金____0301__0301007901__指标说明__TT__指标分类__04__统计周期__01__bm_khjg__机构__bm_dwjjlx__经济类型__维度三__TT__TT__显示精度__1__项目单位__01("0301","0301007901","外部转出金额(本金)"," ","04","01","bm_khjg","机构","bm_dwjjlx","经济类型"," "," ","1","01"),
    H__60__外部转出金额__利息____0301__0301007902__指标说明__TT__指标分类__04__统计周期__01__bm_khjg__机构__bm_dwjjlx__经济类型__维度三__TT__TT__显示精度__1__项目单位__01("0301","0301007902","外部转出金额(利息)"," ","04","01","bm_khjg","机构","bm_dwjjlx","经济类型"," "," ","1","01"),
    H__61__结转利息额__0301__0301008001__指标说明__TT__指标分类__03__统计周期__01__bm_khjg__机构__bm_dwjjlx__经济类型__维度三__TT__TT__显示精度__1__项目单位__01("0301","0301008001","结转利息额"," ","03","01","bm_khjg","机构","bm_dwjjlx","经济类型"," "," ","1","01"),
    H__62__结转利息额__正常职工结转____0301__0301008002__指标说明__TT__指标分类__03__统计周期__01__bm_khjg__机构__bm_dwjjlx__经济类型__维度三__TT__TT__显示精度__1__项目单位__01("0301","0301008002","结转利息额（正常职工结转）"," ","03","01","bm_khjg","机构","bm_dwjjlx","经济类型"," "," ","1","01"),
    H__63__结转利息额__非正常职工结转____0301__0301008003__指标说明__TT__指标分类__03__统计周期__01__bm_khjg__机构__bm_dwjjlx__经济类型__维度三__TT__TT__显示精度__1__项目单位__01("0301","0301008003","结转利息额（非正常职工结转）"," ","03","01","bm_khjg","机构","bm_dwjjlx","经济类型"," "," ","1","01"),
    H__64__非正常账户余额__0301__0301008004__指标说明__TT__指标分类__03__统计周期__03__bm_khjg__机构__bm_dwjjlx__经济类型__维度三__TT__TT__显示精度__1__项目单位__03("0301","0301008004","非正常账户余额"," ","03","03","bm_khjg","机构","bm_dwjjlx","经济类型"," "," ","1","03"),
    H__65__归集余额__0301__0301008101__指标说明__TT__指标分类__03__统计周期__01__bm_khjg__机构__bm_dwjjlx__经济类型__维度三__TT__TT__显示精度__1__项目单位__01("0301","0301008101","归集余额"," ","03","01","bm_khjg","机构","bm_dwjjlx","经济类型"," "," ","1","01"),
    H__66__暂存款余额__0301__0301008102__指标说明__TT__指标分类__03__统计周期__01__bm_khjg__机构__bm_dwjjlx__经济类型__维度三__TT__TT__显示精度__1__项目单位__01("0301","0301008102","暂存款余额"," ","03","01","bm_khjg","机构","bm_dwjjlx","经济类型"," "," ","1","01"),
    H__67__历史累计归集额__0301__0301010101__指标说明__TT__指标分类__05__统计周期__01__bm_khjg__机构__bm_dwjjlx__经济类型__维度三__TT__TT__显示精度__1__项目单位__01("0301","0301010101","历史累计归集额"," ","05","01","bm_khjg","机构","bm_dwjjlx","经济类型"," "," ","1","01"),
    H__68__历史累计补缴额__0301__0301010201__指标说明__TT__指标分类__05__统计周期__03__bm_khjg__机构__bm_dwjjlx__经济类型__维度三__TT__TT__显示精度__1__项目单位__01("0301","0301010201","历史累计补缴额"," ","05","03","bm_khjg","机构","bm_dwjjlx","经济类型"," "," ","1","01"),
    H__69__历史累计外部转入额__0301__0301010501__指标说明__TT__指标分类__05__统计周期__03__bm_khjg__机构__bm_dwjjlx__经济类型__维度三__TT__TT__显示精度__1__项目单位__01("0301","0301010501","历史累计外部转入额"," ","05","03","bm_khjg","机构","bm_dwjjlx","经济类型"," "," ","1","01"),
    H__70__历史累计外部转出额__0301__0301010601__指标说明__TT__指标分类__05__统计周期__03__bm_khjg__机构__bm_dwjjlx__经济类型__维度三__TT__TT__显示精度__1__项目单位__01("0301","0301010601","历史累计外部转出额"," ","05","03","bm_khjg","机构","bm_dwjjlx","经济类型"," "," ","1","01"),
    H__71__历史累计提取额__0301__0301010701__指标说明__TT__指标分类__05__统计周期__01__bm_khjg__机构__bm_dwjjlx__经济类型__维度三__TT__TT__显示精度__1__项目单位__01("0301","0301010701","历史累计提取额"," ","05","01","bm_khjg","机构","bm_dwjjlx","经济类型"," "," ","1","01"),
    H__72__历史累计提取额__提取原因____0301__0301010711__指标说明__TT__指标分类__05__统计周期__01__bm_khjg__机构__bm_gz_tqyy__提取原因__维度三__TT__TT__显示精度__1__项目单位__01("0301","0301010711","历史累计提取额(提取原因)"," ","05","01","bm_khjg","机构","bm_gz_tqyy","提取原因"," "," ","1","01"),
    H__73__历史累计归集人数__0301__0301010801__指标说明__TT__指标分类__05__统计周期__01__bm_khjg__机构__bm_dwjjlx__经济类型__维度三__TT__TT__显示精度__0__项目单位__02("0301","0301010801","历史累计归集人数"," ","05","01","bm_khjg","机构","bm_dwjjlx","经济类型"," "," ","0","02"),
    H__74__历史累计补缴人数__0301__0301010901__指标说明__TT__指标分类__05__统计周期__03__bm_khjg__机构__bm_dwjjlx__经济类型__维度三__TT__TT__显示精度__0__项目单位__02("0301","0301010901","历史累计补缴人数"," ","05","03","bm_khjg","机构","bm_dwjjlx","经济类型"," "," ","0","02"),
    H__75__历史累计提取人数__0301__0301011001__指标说明__TT__指标分类__05__统计周期__03__bm_khjg__机构__bm_dwjjlx__经济类型__维度三__TT__TT__显示精度__0__项目单位__02("0301","0301011001","历史累计提取人数"," ","05","03","bm_khjg","机构","bm_dwjjlx","经济类型"," "," ","0","02"),
    H__76__历史累计提取人数__提取原因____0301__0301011002__指标说明__TT__指标分类__05__统计周期__03__bm_khjg__机构__bm_gz_tqyy__提取原因__维度三__TT__TT__显示精度__0__项目单位__02("0301","0301011002","历史累计提取人数(提取原因)"," ","05","03","bm_khjg","机构","bm_gz_tqyy","提取原因"," "," ","0","02"),
    H__77__历史累计单位账户数__0301__0301011003__指标说明__TT__指标分类__05__统计周期__03__bm_khjg__机构__bm_dwjjlx__经济类型__维度三__TT__TT__显示精度__0__项目单位__03("0301","0301011003","历史累计单位账户数"," ","05","03","bm_khjg","机构","bm_dwjjlx","经济类型"," "," ","0","03"),
    H__78__历史累计个人账户数__0301__0301011004__指标说明__TT__指标分类__05__统计周期__03__bm_khjg__机构__bm_dwjjlx__经济类型__维度三__TT__TT__显示精度__0__项目单位__03("0301","0301011004","历史累计个人账户数"," ","05","03","bm_khjg","机构","bm_dwjjlx","经济类型"," "," ","0","03"),
    H__79__住房公积金缴存率__0301__0301020101__指标说明__TT__指标分类__06__统计周期__06__TT__TT__TT__TT__维度三__TT__TT__显示精度__1__项目单位__TT("0301","0301020101","住房公积金缴存率"," ","06","06"," "," "," "," "," "," ","1"," "),
    H__80__住房公积金覆盖率__0301__0301020201__指标说明__TT__指标分类__06__统计周期__06__TT__TT__TT__TT__维度三__TT__TT__显示精度__1__项目单位__TT("0301","0301020201","住房公积金覆盖率"," ","06","06"," "," "," "," "," "," ","1"," "),
    H__81__住房公积金归集增长率__0301__0301020301__指标说明__TT__指标分类__06__统计周期__06__TT__TT__TT__TT__维度三__TT__TT__显示精度__1__项目单位__TT("0301","0301020301","住房公积金归集增长率"," ","06","06"," "," "," "," "," "," ","1"," "),
    H__82__提取额占缴存额比重__0301__0301020401__指标说明__TT__指标分类__06__统计周期__06__TT__TT__TT__TT__维度三__TT__TT__显示精度__1__项目单位__TT("0301","0301020401","提取额占缴存额比重"," ","06","06"," "," "," "," "," "," ","1"," "),
    H__83__住房公积金使用率__0301__0301020501__指标说明__TT__指标分类__06__统计周期__03__TT__TT__TT__TT__维度三__TT__TT__显示精度__1__项目单位__TT("0301","0301020501","住房公积金使用率"," ","06","03"," "," "," "," "," "," ","1"," "),
    H__84__职工人数__收入水平____0301__0301020502__指标说明__职工人数__收入水平包含低收入___中收入___高收入____指标分类__25__统计周期__06__bm_khjg__机构__bm_bi_srsp__收入水平__维度三__TT__TT__显示精度__0__项目单位__02("0301","0301020502","职工人数(收入水平)","职工人数(收入水平包含低收入___中收入___高收入)","25","06","bm_khjg","机构","bm_bi_srsp","收入水平"," "," ","0","02"),
    H__85__当年缴存额__收入水平____0301__0301020503__指标说明__当年缴存额__收入水平包含低收入___中收入___高收入____指标分类__25__统计周期__03__bm_khjg__机构__bm_bi_srsp__收入水平__维度三__TT__TT__显示精度__1__项目单位__TT("0301","0301020503","当年缴存额(收入水平)","当年缴存额(收入水平包含低收入___中收入___高收入)","25","03","bm_khjg","机构","bm_bi_srsp","收入水平"," "," ","1"," "),
    H__86__新开户职工数__收入水平____0301__0301020506__指标说明__新开户职工数__收入水平包含低收入___中收入___高收入____指标分类__25__统计周期__06__bm_khjg__机构__bm_bi_srsp__收入水平__维度三__TT__TT__显示精度__0__项目单位__TT("0301","0301020506","新开户职工数(收入水平)","新开户职工数(收入水平包含低收入___中收入___高收入)","25","06","bm_khjg","机构","bm_bi_srsp","收入水平"," "," ","0"," "),
    H__87__当年缴存人数__收入水平____0301__0301020507__指标说明__当年缴存人数__收入水平包含低收入___中收入___高收入____指标分类__25__统计周期__06__bm_khjg__机构__bm_bi_srsp__收入水平__维度三__TT__TT__显示精度__1__项目单位__TT("0301","0301020507","当年缴存人数(收入水平)","当年缴存人数(收入水平包含低收入___中收入___高收入)","25","06","bm_khjg","机构","bm_bi_srsp","收入水平"," "," ","1"," "),
    H__88__发放额__0302__0302000101__指标说明__TT__指标分类__07__统计周期__01__bm_khjg__机构__bm_yhbm__银行名称__维度三__TT__TT__显示精度__1__项目单位__01("0302","0302000101","发放额"," ","07","01","bm_khjg","机构","bm_yhbm","银行名称"," "," ","1","01"),
    H__89__发放额__5年以内含____0302__0302000102__指标说明__TT__指标分类__07__统计周期__01__bm_khjg__机构__bm_yhbm__银行名称__维度三__TT__TT__显示精度__1__项目单位__01("0302","0302000102","发放额（5年以内含）"," ","07","01","bm_khjg","机构","bm_yhbm","银行名称"," "," ","1","01"),
    H__90__发放额__5年以上____0302__0302000103__指标说明__TT__指标分类__07__统计周期__01__bm_khjg__机构__bm_yhbm__银行名称__维度三__TT__TT__显示精度__1__项目单位__01("0302","0302000103","发放额（5年以上）"," ","07","01","bm_khjg","机构","bm_yhbm","银行名称"," "," ","1","01"),
    H__91__发放额__贷款年限____0302__0302000105__指标说明__TT__指标分类__22__统计周期__03__bm_khjg__机构__bm_bi_dknx__贷款年限__维度三__TT__TT__显示精度__1__项目单位__TT("0302","0302000105","发放额(贷款年限)"," ","22","03","bm_khjg","机构","bm_bi_dknx","贷款年限"," "," ","1"," "),
    H__92__发放额__担保方式新____0302__0302000106__指标说明__TT__指标分类__23__统计周期__03__bm_khjg__机构__bm_bi_dkdblx__担保方式新__维度三__TT__TT__显示精度__0__项目单位__TT("0302","0302000106","发放额(担保方式新)"," ","23","03","bm_khjg","机构","bm_bi_dkdblx","担保方式新"," "," ","0"," "),
    H__93__发放额__购房面积____0302__0302000107__指标说明__TT__指标分类__20__统计周期__03__bm_khjg__机构__bm_bi_gfmj__购房面积__维度三__TT__TT__显示精度__1__项目单位__TT("0302","0302000107","发放额(购房面积)"," ","20","03","bm_khjg","机构","bm_bi_gfmj","购房面积"," "," ","1"," "),
    H__94__发放额__单位性质____0302__0302000108__指标说明__TT__指标分类__23__统计周期__03__bm_khjg__机构__bm_dwjjlx__单位性质__维度三__TT__TT__显示精度__0__项目单位__TT("0302","0302000108","发放额(单位性质)"," ","23","03","bm_khjg","机构","bm_dwjjlx","单位性质"," "," ","0"," "),
    H__95__发放额__非本市缴存职工开户年限____0302__0302000109__指标说明__TT__指标分类__23__统计周期__06__bm_khjg__机构__bm_bi_khnx__开户年限__维度三__TT__TT__显示精度__0__项目单位__TT("0302","0302000109","发放额(非本市缴存职工开户年限)"," ","23","06","bm_khjg","机构","bm_bi_khnx","开户年限"," "," ","0"," "),
    H__96__发放额__缴存人数____0302__0302000110__指标说明__TT__指标分类__23__统计周期__03__bm_khjg__机构__bm_bi_jcrs__缴存人数__维度三__TT__TT__显示精度__0__项目单位__TT("0302","0302000110","发放额(缴存人数)"," ","23","03","bm_khjg","机构","bm_bi_jcrs","缴存人数"," "," ","0"," "),
    H__97__发放额__贷款次数____0302__0302000111__指标说明__TT__指标分类__23__统计周期__03__bm_khjg__机构__bm_bi_dkcs__贷款次数__维度三__TT__TT__显示精度__0__项目单位__TT("0302","0302000111","发放额(贷款次数)"," ","23","03","bm_khjg","机构","bm_bi_dkcs","贷款次数"," "," ","0"," "),
    H__98__发放额__借款人年龄____0302__0302000112__指标说明__TT__指标分类__23__统计周期__03__bm_khjg__机构__bm_bi_khnx__开户年限__维度三__TT__TT__显示精度__0__项目单位__TT("0302","0302000112","发放额(借款人年龄)"," ","23","03","bm_khjg","机构","bm_bi_khnx","开户年限"," "," ","0"," "),
    H__99__发放额__贷款用途____0302__0302000113__指标说明__TT__指标分类__23__统计周期__03__bm_khjg__机构__bm_bi_dkyt__贷款用途__维度三__TT__TT__显示精度__0__项目单位__TT("0302","0302000113","发放额(贷款用途)"," ","23","03","bm_khjg","机构","bm_bi_dkyt","贷款用途"," "," ","0"," "),
    H__100__发放额__资金来源____0302__0302000114__指标说明__TT__指标分类__23__统计周期__03__bm_khjg__机构__bm_bi_zjly__资金来源__维度三__TT__TT__显示精度__0__项目单位__TT("0302","0302000114","发放额(资金来源)"," ","23","03","bm_khjg","机构","bm_bi_zjly","资金来源"," "," ","0"," "),
    H__101__发放额__贷款金额与房屋价格占比____0302__0302000115__指标说明__TT__指标分类__23__统计周期__03__bm_khjg__机构__bm_bi_gjjdkbl__贷款金额与房屋价格占比__维度三__TT__TT__显示精度__0__项目单位__TT("0302","0302000115","发放额(贷款金额与房屋价格占比)"," ","23","03","bm_khjg","机构","bm_bi_gjjdkbl","贷款金额与房屋价格占比"," "," ","0"," "),
    H__102__发放额__还款方式____0302__0302000116__指标说明__TT__指标分类__23__统计周期__03__bm_khjg__机构__BM_GD_DKHKFS__还款方式__维度三__TT__TT__显示精度__0__项目单位__TT("0302","0302000116","发放额(还款方式)"," ","23","03","bm_khjg","机构","BM_GD_DKHKFS","还款方式"," "," ","0"," "),
    H__103__发放额__贷款时缴存年限____0302__0302000117__指标说明__TT__指标分类__23__统计周期__03__bm_khjg__机构__bm_bi_dkjcnx__贷款时缴存年限__维度三__TT__TT__显示精度__0__项目单位__TT("0302","0302000117","发放额(贷款时缴存年限)"," ","23","03","bm_khjg","机构","bm_bi_dkjcnx","贷款时缴存年限"," "," ","0"," "),
    H__104__发放额__收入水平____0302__0302000119__指标说明__TT__指标分类__09__统计周期__03__bm_khjg__机构__bm_bi_srsp__收入水平__维度三__TT__TT__显示精度__0__项目单位__TT("0302","0302000119","发放额(收入水平)"," ","09","03","bm_khjg","机构","bm_bi_srsp","收入水平"," "," ","0"," "),
    H__105__当年发放异地贷款金额__0302__0302000120__指标说明__TT__指标分类__09__统计周期__06__bm_khjg__机构__TT__TT__维度三__TT__TT__显示精度__0__项目单位__TT("0302","0302000120","当年发放异地贷款金额"," ","09","06","bm_khjg","机构"," "," "," "," ","0"," "),
    H__106__累计发放异地贷款总额__0302__0302000121__指标说明__TT__指标分类__09__统计周期__03__bm_khjg__机构__TT__TT__维度三__TT__TT__显示精度__0__项目单位__TT("0302","0302000121","累计发放异地贷款总额"," ","09","03","bm_khjg","机构"," "," "," "," ","0"," "),
    H__107__回收额__0302__0302000201__指标说明__TT__指标分类__08__统计周期__01__bm_khjg__机构__bm_yhbm__银行名称__维度三__TT__TT__显示精度__1__项目单位__01("0302","0302000201","回收额"," ","08","01","bm_khjg","机构","bm_yhbm","银行名称"," "," ","1","01"),
    H__108__回收额__正常____0302__0302000202__指标说明__TT__指标分类__08__统计周期__01__bm_khjg__机构__bm_yhbm__银行名称__维度三__TT__TT__显示精度__1__项目单位__01("0302","0302000202","回收额（正常）"," ","08","01","bm_khjg","机构","bm_yhbm","银行名称"," "," ","1","01"),
    H__109__回收额__逾期____0302__0302000203__指标说明__TT__指标分类__08__统计周期__01__bm_khjg__机构__bm_yhbm__银行名称__维度三__TT__TT__显示精度__1__项目单位__01("0302","0302000203","回收额（逾期）"," ","08","01","bm_khjg","机构","bm_yhbm","银行名称"," "," ","1","01"),
    H__110__回收额__提前还本____0302__0302000204__指标说明__TT__指标分类__08__统计周期__01__bm_khjg__机构__bm_yhbm__银行名称__维度三__TT__TT__显示精度__1__项目单位__01("0302","0302000204","回收额（提前还本）"," ","08","01","bm_khjg","机构","bm_yhbm","银行名称"," "," ","1","01"),
    H__111__回收额__正常还清____0302__0302000205__指标说明__TT__指标分类__08__统计周期__01__bm_khjg__机构__bm_yhbm__银行名称__维度三__TT__TT__显示精度__1__项目单位__01("0302","0302000205","回收额（正常还清）"," ","08","01","bm_khjg","机构","bm_yhbm","银行名称"," "," ","1","01"),
    H__112__回收额__提前还清____0302__0302000206__指标说明__TT__指标分类__08__统计周期__01__bm_khjg__机构__bm_yhbm__银行名称__维度三__TT__TT__显示精度__1__项目单位__01("0302","0302000206","回收额（提前还清）"," ","08","01","bm_khjg","机构","bm_yhbm","银行名称"," "," ","1","01"),
    H__113__回收额__本行回收____0302__0302000207__指标说明__TT__指标分类__08__统计周期__01__bm_khjg__机构__bm_yhbm__银行名称__维度三__TT__TT__显示精度__1__项目单位__01("0302","0302000207","回收额（本行回收）"," ","08","01","bm_khjg","机构","bm_yhbm","银行名称"," "," ","1","01"),
    H__114__回收额__他行回收____0302__0302000208__指标说明__TT__指标分类__08__统计周期__01__bm_khjg__机构__bm_yhbm__银行名称__维度三__TT__TT__显示精度__1__项目单位__01("0302","0302000208","回收额（他行回收）"," ","08","01","bm_khjg","机构","bm_yhbm","银行名称"," "," ","1","01"),
    H__115__回收额__5年以内含____0302__0302000210__指标说明__TT__指标分类__08__统计周期__01__bm_khjg__机构__bm_yhbm__银行名称__维度三__TT__TT__显示精度__1__项目单位__01("0302","0302000210","回收额（5年以内含）"," ","08","01","bm_khjg","机构","bm_yhbm","银行名称"," "," ","1","01"),
    H__116__回收额__5年以上____0302__0302000211__指标说明__TT__指标分类__08__统计周期__01__bm_khjg__机构__bm_yhbm__银行名称__维度三__TT__TT__显示精度__1__项目单位__01("0302","0302000211","回收额（5年以上）"," ","08","01","bm_khjg","机构","bm_yhbm","银行名称"," "," ","1","01"),
    H__117__回收额__现金____0302__0302000212__指标说明__TT__指标分类__08__统计周期__01__bm_khjg__机构__bm_yhbm__银行名称__维度三__TT__TT__显示精度__1__项目单位__01("0302","0302000212","回收额（现金）"," ","08","01","bm_khjg","机构","bm_yhbm","银行名称"," "," ","1","01"),
    H__118__回收额__冲还贷____0302__0302000213__指标说明__TT__指标分类__08__统计周期__01__bm_khjg__机构__bm_yhbm__银行名称__维度三__TT__TT__显示精度__1__项目单位__01("0302","0302000213","回收额（冲还贷）"," ","08","01","bm_khjg","机构","bm_yhbm","银行名称"," "," ","1","01"),
    H__119__结清额__0302__0302000301__指标说明__TT__指标分类__09__统计周期__01__bm_khjg__机构__bm_yhbm__银行名称__维度三__TT__TT__显示精度__1__项目单位__01("0302","0302000301","结清额"," ","09","01","bm_khjg","机构","bm_yhbm","银行名称"," "," ","1","01"),
    H__120__结清额__正常____0302__0302000302__指标说明__TT__指标分类__09__统计周期__01__bm_khjg__机构__bm_yhbm__银行名称__维度三__TT__TT__显示精度__1__项目单位__01("0302","0302000302","结清额（正常）"," ","09","01","bm_khjg","机构","bm_yhbm","银行名称"," "," ","1","01"),
    H__121__结清额__提前____0302__0302000303__指标说明__TT__指标分类__09__统计周期__01__bm_khjg__机构__bm_yhbm__银行名称__维度三__TT__TT__显示精度__1__项目单位__01("0302","0302000303","结清额（提前）"," ","09","01","bm_khjg","机构","bm_yhbm","银行名称"," "," ","1","01"),
    H__122__结清额__逾期____0302__0302000304__指标说明__TT__指标分类__09__统计周期__01__bm_khjg__机构__bm_yhbm__银行名称__维度三__TT__TT__显示精度__1__项目单位__01("0302","0302000304","结清额（逾期）"," ","09","01","bm_khjg","机构","bm_yhbm","银行名称"," "," ","1","01"),
    H__123__结清额__贷款年限____0302__0302000305__指标说明__TT__指标分类__09__统计周期__03__bm_khjg__机构__bm_bi_dknx__贷款年限__维度三__TT__TT__显示精度__0__项目单位__TT("0302","0302000305","结清额(贷款年限)"," ","09","03","bm_khjg","机构","bm_bi_dknx","贷款年限"," "," ","0"," "),
    H__124__回收利息__0302__0302000401__指标说明__TT__指标分类__10__统计周期__01__bm_khjg__机构__bm_yhbm__银行名称__维度三__TT__TT__显示精度__1__项目单位__01("0302","0302000401","回收利息"," ","10","01","bm_khjg","机构","bm_yhbm","银行名称"," "," ","1","01"),
    H__125__回收利息__正常____0302__0302000402__指标说明__TT__指标分类__10__统计周期__01__bm_khjg__机构__bm_yhbm__银行名称__维度三__TT__TT__显示精度__1__项目单位__01("0302","0302000402","回收利息（正常）"," ","10","01","bm_khjg","机构","bm_yhbm","银行名称"," "," ","1","01"),
    H__126__回收利息__逾期____0302__0302000403__指标说明__TT__指标分类__10__统计周期__01__bm_khjg__机构__bm_yhbm__银行名称__维度三__TT__TT__显示精度__1__项目单位__01("0302","0302000403","回收利息（逾期）"," ","10","01","bm_khjg","机构","bm_yhbm","银行名称"," "," ","1","01"),
    H__127__回收利息__提前还本____0302__0302000404__指标说明__TT__指标分类__10__统计周期__01__bm_khjg__机构__bm_yhbm__银行名称__维度三__TT__TT__显示精度__1__项目单位__01("0302","0302000404","回收利息（提前还本）"," ","10","01","bm_khjg","机构","bm_yhbm","银行名称"," "," ","1","01"),
    H__128__回收利息__正常还清____0302__0302000405__指标说明__TT__指标分类__10__统计周期__01__bm_khjg__机构__bm_yhbm__银行名称__维度三__TT__TT__显示精度__1__项目单位__01("0302","0302000405","回收利息（正常还清）"," ","10","01","bm_khjg","机构","bm_yhbm","银行名称"," "," ","1","01"),
    H__129__回收利息__提前还清____0302__0302000406__指标说明__TT__指标分类__10__统计周期__01__bm_khjg__机构__bm_yhbm__银行名称__维度三__TT__TT__显示精度__1__项目单位__01("0302","0302000406","回收利息（提前还清）"," ","10","01","bm_khjg","机构","bm_yhbm","银行名称"," "," ","1","01"),
    H__130__回收利息__本行回收____0302__0302000407__指标说明__TT__指标分类__10__统计周期__01__bm_khjg__机构__bm_yhbm__银行名称__维度三__TT__TT__显示精度__1__项目单位__01("0302","0302000407","回收利息（本行回收）"," ","10","01","bm_khjg","机构","bm_yhbm","银行名称"," "," ","1","01"),
    H__131__回收利息__他行回收____0302__0302000408__指标说明__TT__指标分类__10__统计周期__01__bm_khjg__机构__bm_yhbm__银行名称__维度三__TT__TT__显示精度__1__项目单位__01("0302","0302000408","回收利息（他行回收）"," ","10","01","bm_khjg","机构","bm_yhbm","银行名称"," "," ","1","01"),
    H__132__回收利息__5年以下含____0302__0302000410__指标说明__TT__指标分类__10__统计周期__01__bm_khjg__机构__bm_yhbm__银行名称__维度三__TT__TT__显示精度__1__项目单位__01("0302","0302000410","回收利息（5年以下含）"," ","10","01","bm_khjg","机构","bm_yhbm","银行名称"," "," ","1","01"),
    H__133__回收利息__5年以上____0302__0302000411__指标说明__TT__指标分类__10__统计周期__01__bm_khjg__机构__bm_yhbm__银行名称__维度三__TT__TT__显示精度__1__项目单位__01("0302","0302000411","回收利息（5年以上）"," ","10","01","bm_khjg","机构","bm_yhbm","银行名称"," "," ","1","01"),
    H__134__应收本息__0302__0302000601__指标说明__TT__指标分类__11__统计周期__01__bm_khjg__机构__bm_yhbm__银行名称__维度三__TT__TT__显示精度__1__项目单位__01("0302","0302000601","应收本息"," ","11","01","bm_khjg","机构","bm_yhbm","银行名称"," "," ","1","01"),
    H__135__应收本金__0302__0302000602__指标说明__TT__指标分类__11__统计周期__01__bm_khjg__机构__bm_yhbm__银行名称__维度三__TT__TT__显示精度__1__项目单位__01("0302","0302000602","应收本金"," ","11","01","bm_khjg","机构","bm_yhbm","银行名称"," "," ","1","01"),
    H__136__应收利息__0302__0302000603__指标说明__TT__指标分类__11__统计周期__01__bm_khjg__机构__bm_yhbm__银行名称__维度三__TT__TT__显示精度__1__项目单位__01("0302","0302000603","应收利息"," ","11","01","bm_khjg","机构","bm_yhbm","银行名称"," "," ","1","01"),
    H__137__逾期本息__本期发生____0302__0302000701__指标说明__TT__指标分类__12__统计周期__01__bm_khjg__机构__bm_yhbm__银行名称__维度三__TT__TT__显示精度__1__项目单位__01("0302","0302000701","逾期本息（本期发生）"," ","12","01","bm_khjg","机构","bm_yhbm","银行名称"," "," ","1","01"),
    H__138__逾期本金__本期发生____0302__0302000702__指标说明__TT__指标分类__12__统计周期__01__bm_khjg__机构__bm_yhbm__银行名称__维度三__TT__TT__显示精度__1__项目单位__01("0302","0302000702","逾期本金（本期发生）"," ","12","01","bm_khjg","机构","bm_yhbm","银行名称"," "," ","1","01"),
    H__139__逾期利息__本期发生____0302__0302000703__指标说明__TT__指标分类__12__统计周期__01__bm_khjg__机构__bm_yhbm__银行名称__维度三__TT__TT__显示精度__1__项目单位__01("0302","0302000703","逾期利息（本期发生）"," ","12","01","bm_khjg","机构","bm_yhbm","银行名称"," "," ","1","01"),
    H__140__贷款余额__0302__0302000801__指标说明__TT__指标分类__13__统计周期__01__bm_khjg__机构__bm_yhbm__银行名称__维度三__TT__TT__显示精度__1__项目单位__01("0302","0302000801","贷款余额"," ","13","01","bm_khjg","机构","bm_yhbm","银行名称"," "," ","1","01"),
    H__141__贷款余额__5年以内含____0302__0302000802__指标说明__TT__指标分类__13__统计周期__01__bm_khjg__机构__bm_yhbm__银行名称__维度三__TT__TT__显示精度__1__项目单位__01("0302","0302000802","贷款余额（5年以内含）"," ","13","01","bm_khjg","机构","bm_yhbm","银行名称"," "," ","1","01"),
    H__142__贷款余额__5年以上____0302__0302000803__指标说明__TT__指标分类__13__统计周期__01__bm_khjg__机构__bm_yhbm__银行名称__维度三__TT__TT__显示精度__1__项目单位__01("0302","0302000803","贷款余额（5年以上）"," ","13","01","bm_khjg","机构","bm_yhbm","银行名称"," "," ","1","01"),
    H__143__异地贷款余额__0302__0302000804__指标说明__TT__指标分类__13__统计周期__01__bm_khjg__机构__TT__TT__维度三__TT__TT__显示精度__1__项目单位__TT("0302","0302000804","异地贷款余额"," ","13","01","bm_khjg","机构"," "," "," "," ","1"," "),
    H__144__贷款余额__逾期期次____0302__0302000808__指标说明__TT__指标分类__13__统计周期__01__bm_khjg__机构__bm_bi_yqqc__逾期期次__维度三__TT__TT__显示精度__1__项目单位__01("0302","0302000808","贷款余额(逾期期次)"," ","13","01","bm_khjg","机构","bm_bi_yqqc","逾期期次"," "," ","1","01"),
    H__145__目前逾期本息__0302__0302000901__指标说明__TT__指标分类__12__统计周期__01__bm_khjg__机构__bm_yhbm__银行名称__维度三__TT__TT__显示精度__1__项目单位__01("0302","0302000901","目前逾期本息"," ","12","01","bm_khjg","机构","bm_yhbm","银行名称"," "," ","1","01"),
    H__146__目前逾期本金__0302__0302000902__指标说明__TT__指标分类__12__统计周期__01__bm_khjg__机构__bm_yhbm__银行名称__维度三__TT__TT__显示精度__1__项目单位__01("0302","0302000902","目前逾期本金"," ","12","01","bm_khjg","机构","bm_yhbm","银行名称"," "," ","1","01"),
    H__147__目前逾期利息__0302__0302000903__指标说明__TT__指标分类__12__统计周期__01__bm_khjg__机构__bm_yhbm__银行名称__维度三__TT__TT__显示精度__1__项目单位__01("0302","0302000903","目前逾期利息"," ","12","01","bm_khjg","机构","bm_yhbm","银行名称"," "," ","1","01"),
    H__148__目前逾期本息__按期次分类____0302__0302000911__指标说明__TT__指标分类__12__统计周期__01__bm_khjg__机构__bm_yhbm__银行名称__维度三__bm_bi_yqqc__逾期期次__显示精度__1__项目单位__01("0302","0302000911","目前逾期本息（按期次分类）"," ","12","01","bm_khjg","机构","bm_yhbm","银行名称","bm_bi_yqqc","逾期期次","1","01"),
    H__149__目前逾期本金__按期次分类____0302__0302000912__指标说明__TT__指标分类__12__统计周期__01__bm_khjg__机构__bm_yhbm__银行名称__维度三__bm_bi_yqqc__逾期期次__显示精度__1__项目单位__01("0302","0302000912","目前逾期本金（按期次分类）"," ","12","01","bm_khjg","机构","bm_yhbm","银行名称","bm_bi_yqqc","逾期期次","1","01"),
    H__150__目前逾期利息__按期次分类____0302__0302000913__指标说明__TT__指标分类__12__统计周期__01__bm_khjg__机构__bm_yhbm__银行名称__维度三__bm_bi_yqqc__逾期期次__显示精度__1__项目单位__01("0302","0302000913","目前逾期利息（按期次分类）"," ","12","01","bm_khjg","机构","bm_yhbm","银行名称","bm_bi_yqqc","逾期期次","1","01"),
    H__151__发放户数__0302__0302002001__指标说明__TT__指标分类__07__统计周期__01__bm_khjg__机构__bm_yhbm__银行名称__维度三__TT__TT__显示精度__0__项目单位__03("0302","0302002001","发放户数"," ","07","01","bm_khjg","机构","bm_yhbm","银行名称"," "," ","0","03"),
    H__152__发放户数__5年以内含____0302__0302002002__指标说明__TT__指标分类__07__统计周期__01__bm_khjg__机构__bm_yhbm__银行名称__维度三__TT__TT__显示精度__0__项目单位__03("0302","0302002002","发放户数（5年以内含）"," ","07","01","bm_khjg","机构","bm_yhbm","银行名称"," "," ","0","03"),
    H__153__发放户数__5年以上____0302__0302002003__指标说明__TT__指标分类__07__统计周期__01__bm_khjg__机构__bm_yhbm__银行名称__维度三__TT__TT__显示精度__0__项目单位__03("0302","0302002003","发放户数（5年以上）"," ","07","01","bm_khjg","机构","bm_yhbm","银行名称"," "," ","0","03"),
    H__154__发放户数__贷款年限____0302__0302002005__指标说明__TT__指标分类__22__统计周期__03__bm_khjg__机构__bm_bi_dknx__贷款年限__维度三__TT__TT__显示精度__0__项目单位__TT("0302","0302002005","发放户数(贷款年限)"," ","22","03","bm_khjg","机构","bm_bi_dknx","贷款年限"," "," ","0"," "),
    H__155__发放户数__担保方式新____0302__0302002006__指标说明__TT__指标分类__23__统计周期__03__bm_khjg__机构__bm_bi_dkdblx__担保方式新__维度三__TT__TT__显示精度__0__项目单位__TT("0302","0302002006","发放户数(担保方式新)"," ","23","03","bm_khjg","机构","bm_bi_dkdblx","担保方式新"," "," ","0"," "),
    H__156__发放户数__单位性质____0302__0302002007__指标说明__TT__指标分类__23__统计周期__03__bm_khjg__机构__bm_dwjjlx__单位性质__维度三__TT__TT__显示精度__0__项目单位__TT("0302","0302002007","发放户数(单位性质)"," ","23","03","bm_khjg","机构","bm_dwjjlx","单位性质"," "," ","0"," "),
    H__157__发放户数__非本市缴存职工开户年限____0302__0302002008__指标说明__TT__指标分类__23__统计周期__06__bm_khjg__机构__bm_bi_khnx__开户年限__维度三__TT__TT__显示精度__0__项目单位__TT("0302","0302002008","发放户数(非本市缴存职工开户年限)"," ","23","06","bm_khjg","机构","bm_bi_khnx","开户年限"," "," ","0"," "),
    H__158__发放户数__贷款次数____0302__0302002009__指标说明__TT__指标分类__23__统计周期__03__bm_khjg__机构__bm_bi_dkcs__贷款次数__维度三__TT__TT__显示精度__0__项目单位__TT("0302","0302002009","发放户数(贷款次数)"," ","23","03","bm_khjg","机构","bm_bi_dkcs","贷款次数"," "," ","0"," "),
    H__159__发放户数__借款人年龄____0302__0302002010__指标说明__TT__指标分类__23__统计周期__03__bm_khjg__机构__bm_bi_khnx__开户年限__维度三__TT__TT__显示精度__0__项目单位__TT("0302","0302002010","发放户数(借款人年龄)"," ","23","03","bm_khjg","机构","bm_bi_khnx","开户年限"," "," ","0"," "),
    H__160__发放户数__还款方式____0302__0302002011__指标说明__TT__指标分类__23__统计周期__03__bm_khjg__机构__BM_GD_DKHKFS__还款方式__维度三__TT__TT__显示精度__0__项目单位__TT("0302","0302002011","发放户数(还款方式)"," ","23","03","bm_khjg","机构","BM_GD_DKHKFS","还款方式"," "," ","0"," "),
    H__161__发放户数__贷款金额与房屋价格占比____0302__0302002012__指标说明__TT__指标分类__23__统计周期__03__bm_khjg__机构__bm_bi_gjjdkbl__贷款金额与房屋价格占比__维度三__TT__TT__显示精度__0__项目单位__TT("0302","0302002012","发放户数(贷款金额与房屋价格占比)"," ","23","03","bm_khjg","机构","bm_bi_gjjdkbl","贷款金额与房屋价格占比"," "," ","0"," "),
    H__162__发放户数__资金来源____0302__0302002013__指标说明__TT__指标分类__23__统计周期__03__bm_khjg__机构__bm_bi_zjly__资金来源__维度三__TT__TT__显示精度__0__项目单位__TT("0302","0302002013","发放户数(资金来源)"," ","23","03","bm_khjg","机构","bm_bi_zjly","资金来源"," "," ","0"," "),
    H__163__发放户数__贷款用途____0302__0302002014__指标说明__TT__指标分类__23__统计周期__03__bm_khjg__机构__bm_bi_dkyt__贷款用途__维度三__TT__TT__显示精度__0__项目单位__TT("0302","0302002014","发放户数(贷款用途)"," ","23","03","bm_khjg","机构","bm_bi_dkyt","贷款用途"," "," ","0"," "),
    H__164__发放户数__缴存人数____0302__0302002015__指标说明__TT__指标分类__23__统计周期__03__bm_khjg__机构__bm_bi_jcrs__缴存人数__维度三__TT__TT__显示精度__0__项目单位__TT("0302","0302002015","发放户数(缴存人数)"," ","23","03","bm_khjg","机构","bm_bi_jcrs","缴存人数"," "," ","0"," "),
    H__165__发放户数__贷款时缴存年限____0302__0302002016__指标说明__TT__指标分类__23__统计周期__03__bm_khjg__机构__bm_bi_dkjcnx__贷款时缴存年限__维度三__TT__TT__显示精度__0__项目单位__TT("0302","0302002016","发放户数(贷款时缴存年限)"," ","23","03","bm_khjg","机构","bm_bi_dkjcnx","贷款时缴存年限"," "," ","0"," "),
    H__166__发放户数__收入水平____0302__0302002018__指标说明__TT__指标分类__09__统计周期__03__bm_khjg__机构__bm_bi_srsp__收入水平__维度三__TT__TT__显示精度__0__项目单位__TT("0302","0302002018","发放户数(收入水平)"," ","09","03","bm_khjg","机构","bm_bi_srsp","收入水平"," "," ","0"," "),
    H__167__当年发放异地贷款笔数__0302__0302002019__指标说明__TT__指标分类__09__统计周期__06__bm_khjg__机构__TT__TT__维度三__TT__TT__显示精度__0__项目单位__TT("0302","0302002019","当年发放异地贷款笔数"," ","09","06","bm_khjg","机构"," "," "," "," ","0"," "),
    H__168__累计发放异地贷款笔数__0302__0302002020__指标说明__TT__指标分类__09__统计周期__03__bm_khjg__机构__TT__TT__维度三__TT__TT__显示精度__0__项目单位__TT("0302","0302002020","累计发放异地贷款笔数"," ","09","03","bm_khjg","机构"," "," "," "," ","0"," "),
    H__169__回收户数__0302__0302002101__指标说明__TT__指标分类__08__统计周期__03__bm_khjg__机构__bm_yhbm__银行名称__维度三__TT__TT__显示精度__0__项目单位__03("0302","0302002101","回收户数"," ","08","03","bm_khjg","机构","bm_yhbm","银行名称"," "," ","0","03"),
    H__170__回收户数__正常____0302__0302002102__指标说明__TT__指标分类__08__统计周期__03__bm_khjg__机构__bm_yhbm__银行名称__维度三__TT__TT__显示精度__0__项目单位__03("0302","0302002102","回收户数（正常）"," ","08","03","bm_khjg","机构","bm_yhbm","银行名称"," "," ","0","03"),
    H__171__回收户数__逾期____0302__0302002103__指标说明__TT__指标分类__08__统计周期__03__bm_khjg__机构__bm_yhbm__银行名称__维度三__TT__TT__显示精度__0__项目单位__03("0302","0302002103","回收户数（逾期）"," ","08","03","bm_khjg","机构","bm_yhbm","银行名称"," "," ","0","03"),
    H__172__回收户数__提前还本____0302__0302002104__指标说明__TT__指标分类__08__统计周期__03__bm_khjg__机构__bm_yhbm__银行名称__维度三__TT__TT__显示精度__0__项目单位__03("0302","0302002104","回收户数（提前还本）"," ","08","03","bm_khjg","机构","bm_yhbm","银行名称"," "," ","0","03"),
    H__173__回收户数__正常还清____0302__0302002105__指标说明__TT__指标分类__08__统计周期__03__bm_khjg__机构__bm_yhbm__银行名称__维度三__TT__TT__显示精度__0__项目单位__03("0302","0302002105","回收户数（正常还清）"," ","08","03","bm_khjg","机构","bm_yhbm","银行名称"," "," ","0","03"),
    H__174__回收户数__提前还清____0302__0302002106__指标说明__TT__指标分类__08__统计周期__03__bm_khjg__机构__bm_yhbm__银行名称__维度三__TT__TT__显示精度__0__项目单位__03("0302","0302002106","回收户数（提前还清）"," ","08","03","bm_khjg","机构","bm_yhbm","银行名称"," "," ","0","03"),
    H__175__回收户数__本行回收____0302__0302002107__指标说明__TT__指标分类__08__统计周期__03__bm_khjg__机构__bm_yhbm__银行名称__维度三__TT__TT__显示精度__0__项目单位__03("0302","0302002107","回收户数（本行回收）"," ","08","03","bm_khjg","机构","bm_yhbm","银行名称"," "," ","0","03"),
    H__176__回收户数__他行回收____0302__0302002108__指标说明__TT__指标分类__08__统计周期__03__bm_khjg__机构__bm_yhbm__银行名称__维度三__TT__TT__显示精度__0__项目单位__03("0302","0302002108","回收户数（他行回收）"," ","08","03","bm_khjg","机构","bm_yhbm","银行名称"," "," ","0","03"),
    H__177__结清户数__0302__0302002201__指标说明__TT__指标分类__09__统计周期__03__bm_khjg__机构__bm_yhbm__银行名称__维度三__TT__TT__显示精度__0__项目单位__03("0302","0302002201","结清户数"," ","09","03","bm_khjg","机构","bm_yhbm","银行名称"," "," ","0","03"),
    H__178__结清户数__正常____0302__0302002202__指标说明__TT__指标分类__09__统计周期__03__bm_khjg__机构__bm_yhbm__银行名称__维度三__TT__TT__显示精度__0__项目单位__03("0302","0302002202","结清户数（正常）"," ","09","03","bm_khjg","机构","bm_yhbm","银行名称"," "," ","0","03"),
    H__179__结清户数__提前____0302__0302002203__指标说明__TT__指标分类__09__统计周期__03__bm_khjg__机构__bm_yhbm__银行名称__维度三__TT__TT__显示精度__0__项目单位__03("0302","0302002203","结清户数（提前）"," ","09","03","bm_khjg","机构","bm_yhbm","银行名称"," "," ","0","03"),
    H__180__结清户数__贷款年限____0302__0302002204__指标说明__TT__指标分类__09__统计周期__03__bm_khjg__机构__bm_bi_dknx__贷款年限__维度三__TT__TT__显示精度__0__项目单位__TT("0302","0302002204","结清户数(贷款年限)"," ","09","03","bm_khjg","机构","bm_bi_dknx","贷款年限"," "," ","0"," "),
    H__181__目前逾期户数__0302__0302002301__指标说明__TT__指标分类__12__统计周期__01__bm_khjg__机构__bm_yhbm__银行名称__维度三__TT__TT__显示精度__0__项目单位__03("0302","0302002301","目前逾期户数"," ","12","01","bm_khjg","机构","bm_yhbm","银行名称"," "," ","0","03"),
    H__182__目前逾期户数__按期次分类____0302__0302002311__指标说明__TT__指标分类__12__统计周期__01__bm_khjg__机构__bm_yhbm__银行名称__维度三__bm_bi_yqqc__逾期期次__显示精度__0__项目单位__03("0302","0302002311","目前逾期户数（按期次分类）"," ","12","01","bm_khjg","机构","bm_yhbm","银行名称","bm_bi_yqqc","逾期期次","0","03"),
    H__183__历史累计发放额__0302__0302010101__指标说明__TT__指标分类__14__统计周期__01__bm_khjg__机构__bm_yhbm__银行名称__维度三__TT__TT__显示精度__1__项目单位__01("0302","0302010101","历史累计发放额"," ","14","01","bm_khjg","机构","bm_yhbm","银行名称"," "," ","1","01"),
    H__184__历史累计发放额__5年以内含____0302__0302010102__指标说明__TT__指标分类__14__统计周期__01__bm_khjg__机构__bm_yhbm__银行名称__维度三__TT__TT__显示精度__1__项目单位__01("0302","0302010102","历史累计发放额（5年以内含）"," ","14","01","bm_khjg","机构","bm_yhbm","银行名称"," "," ","1","01"),
    H__185__历史累计发放额__5年以上____0302__0302010103__指标说明__TT__指标分类__14__统计周期__01__bm_khjg__机构__bm_yhbm__银行名称__维度三__TT__TT__显示精度__1__项目单位__01("0302","0302010103","历史累计发放额（5年以上）"," ","14","01","bm_khjg","机构","bm_yhbm","银行名称"," "," ","1","01"),
    H__186__历史累计回收额__0302__0302010201__指标说明__TT__指标分类__15__统计周期__01__bm_khjg__机构__bm_yhbm__银行名称__维度三__TT__TT__显示精度__1__项目单位__01("0302","0302010201","历史累计回收额"," ","15","01","bm_khjg","机构","bm_yhbm","银行名称"," "," ","1","01"),
    H__187__历史累计回收额__正常____0302__0302010202__指标说明__TT__指标分类__15__统计周期__01__bm_khjg__机构__bm_yhbm__银行名称__维度三__TT__TT__显示精度__1__项目单位__01("0302","0302010202","历史累计回收额（正常）"," ","15","01","bm_khjg","机构","bm_yhbm","银行名称"," "," ","1","01"),
    H__188__历史累计回收额__逾期____0302__0302010203__指标说明__TT__指标分类__15__统计周期__01__bm_khjg__机构__bm_yhbm__银行名称__维度三__TT__TT__显示精度__1__项目单位__01("0302","0302010203","历史累计回收额（逾期）"," ","15","01","bm_khjg","机构","bm_yhbm","银行名称"," "," ","1","01"),
    H__189__历史累计回收额__提前还本____0302__0302010204__指标说明__TT__指标分类__15__统计周期__01__bm_khjg__机构__bm_yhbm__银行名称__维度三__TT__TT__显示精度__1__项目单位__01("0302","0302010204","历史累计回收额（提前还本）"," ","15","01","bm_khjg","机构","bm_yhbm","银行名称"," "," ","1","01"),
    H__190__历史累计回收额__正常还清____0302__0302010205__指标说明__TT__指标分类__15__统计周期__01__bm_khjg__机构__bm_yhbm__银行名称__维度三__TT__TT__显示精度__1__项目单位__01("0302","0302010205","历史累计回收额（正常还清）"," ","15","01","bm_khjg","机构","bm_yhbm","银行名称"," "," ","1","01"),
    H__191__历史累计回收额__提前还清____0302__0302010206__指标说明__TT__指标分类__15__统计周期__01__bm_khjg__机构__bm_yhbm__银行名称__维度三__TT__TT__显示精度__1__项目单位__01("0302","0302010206","历史累计回收额（提前还清）"," ","15","01","bm_khjg","机构","bm_yhbm","银行名称"," "," ","1","01"),
    H__192__历史累计回收额__本行回收____0302__0302010207__指标说明__TT__指标分类__15__统计周期__01__bm_khjg__机构__bm_yhbm__银行名称__维度三__TT__TT__显示精度__1__项目单位__01("0302","0302010207","历史累计回收额（本行回收）"," ","15","01","bm_khjg","机构","bm_yhbm","银行名称"," "," ","1","01"),
    H__193__历史累计回收额__他行回收____0302__0302010208__指标说明__TT__指标分类__15__统计周期__01__bm_khjg__机构__bm_yhbm__银行名称__维度三__TT__TT__显示精度__1__项目单位__01("0302","0302010208","历史累计回收额（他行回收）"," ","15","01","bm_khjg","机构","bm_yhbm","银行名称"," "," ","1","01"),
    H__194__历史累计回收额__5年以内含____0302__0302010210__指标说明__TT__指标分类__15__统计周期__01__bm_khjg__机构__bm_yhbm__银行名称__维度三__TT__TT__显示精度__1__项目单位__01("0302","0302010210","历史累计回收额（5年以内含）"," ","15","01","bm_khjg","机构","bm_yhbm","银行名称"," "," ","1","01"),
    H__195__历史累计回收额__5年以上____0302__0302010211__指标说明__TT__指标分类__15__统计周期__01__bm_khjg__机构__bm_yhbm__银行名称__维度三__TT__TT__显示精度__1__项目单位__01("0302","0302010211","历史累计回收额（5年以上）"," ","15","01","bm_khjg","机构","bm_yhbm","银行名称"," "," ","1","01"),
    H__196__历史累计回收额__现金____0302__0302010212__指标说明__TT__指标分类__15__统计周期__01__bm_khjg__机构__bm_yhbm__银行名称__维度三__TT__TT__显示精度__1__项目单位__TT("0302","0302010212","历史累计回收额（现金）"," ","15","01","bm_khjg","机构","bm_yhbm","银行名称"," "," ","1"," "),
    H__197__历史累计回收额__冲还贷____0302__0302010213__指标说明__TT__指标分类__15__统计周期__01__bm_khjg__机构__bm_yhbm__银行名称__维度三__TT__TT__显示精度__1__项目单位__TT("0302","0302010213","历史累计回收额（冲还贷）"," ","15","01","bm_khjg","机构","bm_yhbm","银行名称"," "," ","1"," "),
    H__198__历史累计结清额__0302__0302010301__指标说明__TT__指标分类__16__统计周期__01__bm_khjg__机构__bm_yhbm__银行名称__维度三__TT__TT__显示精度__1__项目单位__01("0302","0302010301","历史累计结清额"," ","16","01","bm_khjg","机构","bm_yhbm","银行名称"," "," ","1","01"),
    H__199__历史累计结清额__正常____0302__0302010302__指标说明__TT__指标分类__16__统计周期__01__bm_khjg__机构__bm_yhbm__银行名称__维度三__TT__TT__显示精度__1__项目单位__01("0302","0302010302","历史累计结清额（正常）"," ","16","01","bm_khjg","机构","bm_yhbm","银行名称"," "," ","1","01"),
    H__200__历史累计结清额__提前____0302__0302010303__指标说明__TT__指标分类__16__统计周期__01__bm_khjg__机构__bm_yhbm__银行名称__维度三__TT__TT__显示精度__1__项目单位__01("0302","0302010303","历史累计结清额（提前）"," ","16","01","bm_khjg","机构","bm_yhbm","银行名称"," "," ","1","01"),
    H__201__历史累计结清额__逾期____0302__0302010304__指标说明__TT__指标分类__16__统计周期__01__bm_khjg__机构__bm_yhbm__银行名称__维度三__TT__TT__显示精度__1__项目单位__01("0302","0302010304","历史累计结清额（逾期）"," ","16","01","bm_khjg","机构","bm_yhbm","银行名称"," "," ","1","01"),
    H__202__历史累计回收利息__0302__0302010401__指标说明__TT__指标分类__17__统计周期__01__bm_khjg__机构__bm_yhbm__银行名称__维度三__TT__TT__显示精度__1__项目单位__01("0302","0302010401","历史累计回收利息"," ","17","01","bm_khjg","机构","bm_yhbm","银行名称"," "," ","1","01"),
    H__203__历史累计回收利息__正常____0302__0302010402__指标说明__TT__指标分类__17__统计周期__01__bm_khjg__机构__bm_yhbm__银行名称__维度三__TT__TT__显示精度__1__项目单位__01("0302","0302010402","历史累计回收利息（正常）"," ","17","01","bm_khjg","机构","bm_yhbm","银行名称"," "," ","1","01"),
    H__204__历史累计回收利息__逾期____0302__0302010403__指标说明__TT__指标分类__17__统计周期__01__bm_khjg__机构__bm_yhbm__银行名称__维度三__TT__TT__显示精度__1__项目单位__01("0302","0302010403","历史累计回收利息（逾期）"," ","17","01","bm_khjg","机构","bm_yhbm","银行名称"," "," ","1","01"),
    H__205__历史累计回收利息__提前还本____0302__0302010404__指标说明__TT__指标分类__17__统计周期__01__bm_khjg__机构__bm_yhbm__银行名称__维度三__TT__TT__显示精度__1__项目单位__01("0302","0302010404","历史累计回收利息（提前还本）"," ","17","01","bm_khjg","机构","bm_yhbm","银行名称"," "," ","1","01"),
    H__206__历史累计回收利息__正常还清____0302__0302010405__指标说明__TT__指标分类__17__统计周期__01__bm_khjg__机构__bm_yhbm__银行名称__维度三__TT__TT__显示精度__1__项目单位__01("0302","0302010405","历史累计回收利息（正常还清）"," ","17","01","bm_khjg","机构","bm_yhbm","银行名称"," "," ","1","01"),
    H__207__历史累计回收利息__提前还清____0302__0302010406__指标说明__TT__指标分类__17__统计周期__01__bm_khjg__机构__bm_yhbm__银行名称__维度三__TT__TT__显示精度__1__项目单位__01("0302","0302010406","历史累计回收利息（提前还清）"," ","17","01","bm_khjg","机构","bm_yhbm","银行名称"," "," ","1","01"),
    H__208__历史累计回收利息__本行回收____0302__0302010407__指标说明__TT__指标分类__17__统计周期__01__bm_khjg__机构__bm_yhbm__银行名称__维度三__TT__TT__显示精度__1__项目单位__01("0302","0302010407","历史累计回收利息（本行回收）"," ","17","01","bm_khjg","机构","bm_yhbm","银行名称"," "," ","1","01"),
    H__209__历史累计回收利息__他行回收____0302__0302010408__指标说明__TT__指标分类__17__统计周期__01__bm_khjg__机构__bm_yhbm__银行名称__维度三__TT__TT__显示精度__1__项目单位__01("0302","0302010408","历史累计回收利息（他行回收）"," ","17","01","bm_khjg","机构","bm_yhbm","银行名称"," "," ","1","01"),
    H__210__历史累计回收利息__5年以下含____0302__0302010410__指标说明__TT__指标分类__17__统计周期__01__bm_khjg__机构__bm_yhbm__银行名称__维度三__TT__TT__显示精度__1__项目单位__01("0302","0302010410","历史累计回收利息（5年以下含）"," ","17","01","bm_khjg","机构","bm_yhbm","银行名称"," "," ","1","01"),
    H__211__历史累计回收利息__5年以上____0302__0302010411__指标说明__TT__指标分类__17__统计周期__01__bm_khjg__机构__bm_yhbm__银行名称__维度三__TT__TT__显示精度__1__项目单位__01("0302","0302010411","历史累计回收利息（5年以上）"," ","17","01","bm_khjg","机构","bm_yhbm","银行名称"," "," ","1","01"),
    H__212__历史累计逾期本息__0302__0302010701__指标说明__TT__指标分类__18__统计周期__01__bm_khjg__机构__bm_yhbm__银行名称__维度三__TT__TT__显示精度__1__项目单位__01("0302","0302010701","历史累计逾期本息"," ","18","01","bm_khjg","机构","bm_yhbm","银行名称"," "," ","1","01"),
    H__213__历史累计逾期本金__0302__0302010702__指标说明__TT__指标分类__18__统计周期__01__bm_khjg__机构__bm_yhbm__银行名称__维度三__TT__TT__显示精度__1__项目单位__01("0302","0302010702","历史累计逾期本金"," ","18","01","bm_khjg","机构","bm_yhbm","银行名称"," "," ","1","01"),
    H__214__历史累计逾期利息__0302__0302010703__指标说明__TT__指标分类__18__统计周期__01__bm_khjg__机构__bm_yhbm__银行名称__维度三__TT__TT__显示精度__1__项目单位__01("0302","0302010703","历史累计逾期利息"," ","18","01","bm_khjg","机构","bm_yhbm","银行名称"," "," ","1","01"),
    H__215__历史累计发放户数__0302__0302012001__指标说明__TT__指标分类__14__统计周期__01__bm_khjg__机构__bm_yhbm__银行名称__维度三__TT__TT__显示精度__0__项目单位__03("0302","0302012001","历史累计发放户数"," ","14","01","bm_khjg","机构","bm_yhbm","银行名称"," "," ","0","03"),
    H__216__历史累计发放户数__5年以内含____0302__0302012002__指标说明__TT__指标分类__14__统计周期__01__bm_khjg__机构__bm_yhbm__银行名称__维度三__TT__TT__显示精度__0__项目单位__03("0302","0302012002","历史累计发放户数（5年以内含）"," ","14","01","bm_khjg","机构","bm_yhbm","银行名称"," "," ","0","03"),
    H__217__历史累计发放户数__5年以上____0302__0302012003__指标说明__TT__指标分类__14__统计周期__01__bm_khjg__机构__bm_yhbm__银行名称__维度三__TT__TT__显示精度__0__项目单位__03("0302","0302012003","历史累计发放户数（5年以上）"," ","14","01","bm_khjg","机构","bm_yhbm","银行名称"," "," ","0","03"),
    H__218__存量贷款笔数__0302__0302012004__指标说明__TT__指标分类__07__统计周期__03__bm_khjg__机构__bm_yhbm__银行名称__维度三__TT__TT__显示精度__0__项目单位__04("0302","0302012004","存量贷款笔数"," ","07","03","bm_khjg","机构","bm_yhbm","银行名称"," "," ","0","04"),
    H__219__存量贷款笔数__缴存状态____0302__0302012009__指标说明__TT__指标分类__07__统计周期__03__bm_khjg__机构__bm_gz_grzhzt__缴存状态__维度三__TT__TT__显示精度__0__项目单位__TT("0302","0302012009","存量贷款笔数(缴存状态)"," ","07","03","bm_khjg","机构","bm_gz_grzhzt","缴存状态"," "," ","0"," "),
    H__220__历史累计回收户数__0302__0302012101__指标说明__TT__指标分类__15__统计周期__03__bm_khjg__机构__bm_yhbm__银行名称__维度三__TT__TT__显示精度__0__项目单位__03("0302","0302012101","历史累计回收户数"," ","15","03","bm_khjg","机构","bm_yhbm","银行名称"," "," ","0","03"),
    H__221__历史累计回收户数__正常____0302__0302012102__指标说明__TT__指标分类__15__统计周期__03__bm_khjg__机构__bm_yhbm__银行名称__维度三__TT__TT__显示精度__0__项目单位__03("0302","0302012102","历史累计回收户数（正常）"," ","15","03","bm_khjg","机构","bm_yhbm","银行名称"," "," ","0","03"),
    H__222__历史累计回收户数__逾期____0302__0302012103__指标说明__TT__指标分类__15__统计周期__03__bm_khjg__机构__bm_yhbm__银行名称__维度三__TT__TT__显示精度__0__项目单位__03("0302","0302012103","历史累计回收户数（逾期）"," ","15","03","bm_khjg","机构","bm_yhbm","银行名称"," "," ","0","03"),
    H__223__历史累计回收户数__提前还本____0302__0302012104__指标说明__TT__指标分类__15__统计周期__03__bm_khjg__机构__bm_yhbm__银行名称__维度三__TT__TT__显示精度__0__项目单位__03("0302","0302012104","历史累计回收户数（提前还本）"," ","15","03","bm_khjg","机构","bm_yhbm","银行名称"," "," ","0","03"),
    H__224__历史累计回收户数__正常还清____0302__0302012105__指标说明__TT__指标分类__15__统计周期__03__bm_khjg__机构__bm_yhbm__银行名称__维度三__TT__TT__显示精度__0__项目单位__03("0302","0302012105","历史累计回收户数（正常还清）"," ","15","03","bm_khjg","机构","bm_yhbm","银行名称"," "," ","0","03"),
    H__225__历史累计回收户数__提前还清____0302__0302012106__指标说明__TT__指标分类__15__统计周期__03__bm_khjg__机构__bm_yhbm__银行名称__维度三__TT__TT__显示精度__0__项目单位__03("0302","0302012106","历史累计回收户数（提前还清）"," ","15","03","bm_khjg","机构","bm_yhbm","银行名称"," "," ","0","03"),
    H__226__历史累计回收户数__本行回收____0302__0302012107__指标说明__TT__指标分类__15__统计周期__03__bm_khjg__机构__bm_yhbm__银行名称__维度三__TT__TT__显示精度__0__项目单位__03("0302","0302012107","历史累计回收户数（本行回收）"," ","15","03","bm_khjg","机构","bm_yhbm","银行名称"," "," ","0","03"),
    H__227__历史累计回收户数__他行回收____0302__0302012108__指标说明__TT__指标分类__15__统计周期__03__bm_khjg__机构__bm_yhbm__银行名称__维度三__TT__TT__显示精度__0__项目单位__03("0302","0302012108","历史累计回收户数（他行回收）"," ","15","03","bm_khjg","机构","bm_yhbm","银行名称"," "," ","0","03"),
    H__228__历史累计结清户数__0302__0302012201__指标说明__TT__指标分类__16__统计周期__03__bm_khjg__机构__bm_yhbm__银行名称__维度三__TT__TT__显示精度__0__项目单位__03("0302","0302012201","历史累计结清户数"," ","16","03","bm_khjg","机构","bm_yhbm","银行名称"," "," ","0","03"),
    H__229__历史累计结清户数__正常____0302__0302012202__指标说明__TT__指标分类__16__统计周期__03__bm_khjg__机构__bm_yhbm__银行名称__维度三__TT__TT__显示精度__0__项目单位__03("0302","0302012202","历史累计结清户数（正常）"," ","16","03","bm_khjg","机构","bm_yhbm","银行名称"," "," ","0","03"),
    H__230__历史累计结清户数__提前____0302__0302012203__指标说明__TT__指标分类__16__统计周期__03__bm_khjg__机构__bm_yhbm__银行名称__维度三__TT__TT__显示精度__0__项目单位__03("0302","0302012203","历史累计结清户数（提前）"," ","16","03","bm_khjg","机构","bm_yhbm","银行名称"," "," ","0","03"),
    H__231__历史累计结清户数__逾期____0302__0302012204__指标说明__TT__指标分类__16__统计周期__03__bm_khjg__机构__bm_yhbm__银行名称__维度三__TT__TT__显示精度__0__项目单位__03("0302","0302012204","历史累计结清户数（逾期）"," ","16","03","bm_khjg","机构","bm_yhbm","银行名称"," "," ","0","03"),
    H__232__贷款发放占缴存额比重__月____0302__0302020101__指标说明__TT__指标分类__19__统计周期__03__TT__TT__TT__TT__维度三__TT__TT__显示精度__1__项目单位__TT("0302","0302020101","贷款发放占缴存额比重（月）"," ","19","03"," "," "," "," "," "," ","1"," "),
    H__233__住房公积金运用率__月____0302__0302020201__指标说明__TT__指标分类__19__统计周期__03__TT__TT__TT__TT__维度三__TT__TT__显示精度__1__项目单位__TT("0302","0302020201","住房公积金运用率（月）"," ","19","03"," "," "," "," "," "," ","1"," "),
    H__234__住房公积金个贷率__月____0302__0302020301__指标说明__TT__指标分类__19__统计周期__03__TT__TT__TT__TT__维度三__TT__TT__显示精度__1__项目单位__TT("0302","0302020301","住房公积金个贷率（月）"," ","19","03"," "," "," "," "," "," ","1"," "),
    H__235__住房公积金个贷逾期率__月____0302__0302020401__指标说明__TT__指标分类__19__统计周期__03__TT__TT__TT__TT__维度三__TT__TT__显示精度__1__项目单位__TT("0302","0302020401","住房公积金个贷逾期率（月）"," ","19","03"," "," "," "," "," "," ","1"," "),
    H__236__住房公积金个贷增长率__月____0302__0302020501__指标说明__TT__指标分类__19__统计周期__03__TT__TT__TT__TT__维度三__TT__TT__显示精度__1__项目单位__TT("0302","0302020501","住房公积金个贷增长率（月）"," ","19","03"," "," "," "," "," "," ","1"," "),
    H__237__发放人数__购房面积____0302__0302030001__指标说明__发放人数__购房面积____指标分类__20__统计周期__06__bm_khjg__机构__bm_bi_gfmj__购房面积__维度三__TT__TT__显示精度__0__项目单位__02("0302","0302030001","发放人数(购房面积)","发放人数(购房面积)","20","06","bm_khjg","机构","bm_bi_gfmj","购房面积"," "," ","0","02"),
    H__238__贷款职工人数__收入水平____0302__0302040001__指标说明__贷款职工人数__收入水平包含低收入___中收入___高收入____指标分类__25__统计周期__06__bm_khjg__机构__bm_bi_srsp__收入水平__维度三__TT__TT__显示精度__0__项目单位__02("0302","0302040001","贷款职工人数(收入水平)","贷款职工人数(收入水平包含低收入___中收入___高收入)","25","06","bm_khjg","机构","bm_bi_srsp","收入水平"," "," ","0","02"),
    H__239__贷款职工人数__新房___二手房____0302__0302040002__指标说明__贷款职工人数__新房___二手房____指标分类__26__统计周期__06__bm_khjg__机构__bm_bi_fwxz__房屋性质__维度三__TT__TT__显示精度__0__项目单位__02("0302","0302040002","贷款职工人数(新房___二手房)","贷款职工人数(新房___二手房)","26","06","bm_khjg","机构","bm_bi_fwxz","房屋性质"," "," ","0","02"),
    H__240__共同借款人人数__0302__0302040003__指标说明__TT__指标分类__17__统计周期__03__bm_khjg__机构__TT__TT__维度三__TT__TT__显示精度__0__项目单位__02("0302","0302040003","共同借款人人数"," ","17","03","bm_khjg","机构"," "," "," "," ","0","02"),
    H__241__贷款购房建筑面积__0302__0302040004__指标说明__TT__指标分类__17__统计周期__03__bm_khjg__机构__TT__TT__维度三__TT__TT__显示精度__1__项目单位__05("0302","0302040004","贷款购房建筑面积"," ","17","03","bm_khjg","机构"," "," "," "," ","1","05"),
    H__242__贷款购房建筑总价__0302__0302040005__指标说明__TT__指标分类__17__统计周期__03__bm_khjg__机构__TT__TT__维度三__TT__TT__显示精度__1__项目单位__01("0302","0302040005","贷款购房建筑总价"," ","17","03","bm_khjg","机构"," "," "," "," ","1","01");

    private final String 业务代码;
    private final String 指标编码;
    private final String 指标名称;
    private final String 指标说明;
    private final String 指标分类;

    private final String 统计周期;

    private final String 维度一;
    private final String 维度一描述;
    private final String 维度二;
    private final String 维度二描述;
    private final String 维度三;
    private final String 维度三描述;
    private final String 显示精度;
    private final String 项目单位;



    private 统计指标编码(String 业务代码,
                   String 指标编码,
                   String 指标名称,
                   String 指标说明,
                   String 指标分类,
                   String 统计周期,
                   String 维度一,
                   String 维度一描述,
                   String 维度二,
                   String 维度二描述,
                   String 维度三,
                   String 维度三描述,
                   String 显示精度,
                   String 项目单位) {
        this.业务代码 = 业务代码;
        this.指标编码 = 指标编码;
        this.指标名称 = 指标名称;
        this.指标说明 = 指标说明;
        this.指标分类 = 指标分类;

        this.统计周期 = 统计周期;

        this.维度一 = 维度一;
        this.维度一描述 = 维度一描述;
        this.维度二 = 维度二;
        this.维度二描述 = 维度二描述;
        this.维度三 = 维度三;
        this.维度三描述 = 维度三描述;
        this.显示精度 = 显示精度;
        this.项目单位 = 项目单位;
    }

/*
    public static List<ListItem> retriveTypese() {

        List<ListItem> list = new ArrayList<ListItem>();
        for (AccountingVoucherStatusEnum status : AccountingVoucherStatusEnum.values()) {
            ListItem element = new ListItem(status.getId(), status.getDisplayText(), status.getHelpMessage());
            list.add(element);
        }

        return list;

    }


    public static List<ListItem> retriveTypese(String statusText) {

        List<ListItem> list = new ArrayList<ListItem>();
        for(PersonalAccountStatusEnum status : PersonalAccountStatusEnum.values()) {
            ListItem element = new ListItem(status.getText(), status.getDisplayText());
            if (status.getText().equals(statusText)){
                element.setSelected(true);
            }
            list.add(element);
        }
        return list;

    }*/


/*
    public static StatisticalIndexCodeEnum fromString(String text) {
        for (StatisticalIndexCodeEnum status : StatisticalIndexCodeEnum.values()) {
            if (status.get().equals(text) ) {
                return status;
            }
        }
        throw new RuntimeException("no customer status " + text);
    }

    public static StatisticalIndexCodeEnum fromInt(Integer text) {
        for (StatisticalIndexCodeEnum status : StatisticalIndexCodeEnum.values()) {
            if (status.getId().equals(text) ) {
                return status;
            }
        }
        throw new RuntimeException("no customer status " + text);
    }*/

}
