package org.ylgjj.loan.enumT;

//import com.coalvalue.domain.pojo.ListItem;

/**
 * Created by silence on 2016/1/18.
 */
public enum E_FD045_资金划转业务登记文件_划转原因 {
    E_1 ("1","100","100"),//1
    E_2 ("2","测试","测试"),//7
    E_3 ("3","测试1元","测试1元"),//2
    E_4 ("4","长安结算测试资金划回100","长安结算测试资金划回100"),//1
    E_5 ("5","贷款逾期考核","贷款逾期考核"),//3
    E_6 ("6","第二次100","第二次100"),//1
    E_7 ("7","放款","放款"),//1
    E_8 ("8","放款余额不足","放款余额不足"),//1
    E_9 ("9","更换","更换"),//1
    E_10 ("10","购买国债","购买国债"),//1
    E_11 ("11","划转","划转"),//7
    E_12 ("12","划转增值收益","划转增值收益"),//5
    E_13 ("13","进款处理","进款处理"),//1
    E_14 ("14","跨行上划资金","跨行上划资金"),//1
    E_15 ("15","浦发银行上线财务科划转资金府谷","浦发银行上线财务科划转资金府谷"),//1
    E_16 ("16","浦发银行资金划转100府谷-财务科","浦发银行资金划转100府谷-财务科"),//1
    E_17 ("17","浦发住建部更新测试","浦发住建部更新测试"),//1
    E_18 ("18","上划资金","上划资金"),//2
    E_19 ("19","提高增值收益","提高增值收益"),//17
    E_20 ("20","提升增值收益","提升增值收益"),//1
    E_21 ("21","销户划转","销户划转"),//92
    E_22 ("22","销户转出账户金额","销户转出账户金额"),//1
    E_23 ("23","销户转账","销户转账"),//1
    E_24 ("24","销户资金划转","销户资金划转"),//1
    E_25 ("25","业务调账","业务调账"),//10
    E_26 ("26","业务需要","业务需要"),//1
    E_27 ("27","银行处理失败退回","银行处理失败退回"),//1
    E_28 ("28","银行退回冲正，重新划转","银行退回冲正，重新划转"),//3
    E_29 ("29","邮储银行测试1元钱","邮储银行测试1元钱"),//1
    E_30 ("30","榆林农商生产结算测试，1.00元","榆林农商生产结算测试，1.00元"),//1
    E_31 ("31","榆阳区资金划转1.00元","榆阳区资金划转1.00元"),//1
    E_32 ("32","余额不足","余额不足"),//1
    E_33 ("33","逾期考核","逾期考核"),//2
    E_34 ("34","增值收益","增值收益"),//1
    E_35 ("35","增值收益划转","增值收益划转"),//5
    E_36 ("36","账户调整","账户调整"),//1
    E_37 ("37","账户调整划转","账户调整划转"),//1
    E_38 ("38","住建部更新系统测试","住建部更新系统测试"),//1
    E_39 ("39","住建部系统更新测试","住建部系统更新测试"),//5
    E_40 ("40","专户转增值收益存款","专户转增值收益存款"),//1
    E_41 ("41","专户转增值收益户","专户转增值收益户"),//3
    E_42 ("42","资金","资金"),//1
    E_43 ("43","资金不足","资金不足"),//1
    E_44 ("44","资金划转","资金划转"),//1822
    E_45 ("45","资金划转—业务需要","资金划转—业务需要"),//4
    E_46 ("46","资金划转（5月5日）","资金划转（5月5日）"),//1
    E_47 ("47","资金划转（补记5月4日）","资金划转（补记5月4日）"),//1
    E_48 ("48","资金划转失败","资金划转失败"),//2
    E_49 ("49","资金划转退回","资金划转退回"),//1
    E_50 ("50","资金划转未成功","资金划转未成功"),//1
    E_51 ("51","资金上划","资金上划"),//185

    E_100 ("100","其他","其他"),//185




;






    private final String statusText;
    private final String displayText;


    private String helpMessage;

    public String getHelpMessage() {
        return helpMessage;
    }

    public void setHelpMessage(String helpMessage) {
        this.helpMessage = helpMessage;
    }

    public String getDisplayText() {
        return displayText;
    }

    E_FD045_资金划转业务登记文件_划转原因(String statusText, String displayText, String helpMessage) {
        this.statusText = statusText;
        this.displayText = displayText;

        this.helpMessage = helpMessage;
    }
    public String getText() {
        return this.statusText;
    }



    public static E_FD045_资金划转业务登记文件_划转原因 fromString(String text) {
        for (E_FD045_资金划转业务登记文件_划转原因 status : E_FD045_资金划转业务登记文件_划转原因.values()) {
            if (status.getText().equals(text) ) {
                return status;
            }
        }
        return E_FD045_资金划转业务登记文件_划转原因.E_100;
        //throw new RuntimeException("no customer status " + text);
    }


}
